{
    "artemisApp": {
        "bonus": {
            "bonusStrategy": {
                "title": "Wähle eine Bonusstrategie",
                "helpText": "NOTEN: Berechnet zunächst die Prüfungsnote anhand des Notenschlüssel. Dann wird der Bonus auf diese Note angewandt, um die Endnote zu erhalten.<br>PUNKTE: Wendet zunächst den Bonus auf die Punkte des Studierenden an. Danach wird die Endnote berechnet, indem die resultierenden Punkte mit dem Notenschlüssel für die Prüfung umgerechnet werden.",
                "grades": "NOTEN",
                "points": "PUNKTE"
            },
            "discreteness": {
                "title": "Wähle die Stetigkeit",
                "helpText": "DISKRET: (Noch nicht verfügbar) Erhöht die Note der Studierenden anhand des Notenschlüssels. Die Endnote entspricht dabei einer der Notenstufen der Prüfung (z. B. von 1,3 auf 1,0 oder von B auf A). <br>STETIG: Der Bonus wird einfach rechnerisch auf die Note der Studierenden angewandt. Die Endnote kann ein beliebiger numerischer Wert zwischen der besten und schlechtesten Notenstufe sein (z. B. von 1,3 bis 1,2).",
                "discrete": "DISKRET",
                "continuous": "KONTINUIERLICH"
            },
            "calculation": {
                "title": "Wähle die Berechnungsart",
                "helpText": "− (Standardoption für NOTEN): Zieht den Bonus von der Note/Punktzahl der Prüfung ab. Bevorzugt, wenn ein niedrigerer Wert ein besseres Ergebnis bedeutet.<br>+ (Standardoption für PUNKTE): Addiert einen Bonus zu der Note/Punktzahl der Prüfung hinzu. Bevorzugt, wenn ein höherer Wert ein besses Ergebnis bedeutet."
            },
            "bonusSource": {
                "title": "Wähle die Quelle für den Bonus",
                "helpText": "Prüfungen und Kurse mit einem \"Bonus\"-Notenschlüssel sind unten aufgeführt. Die Note der Studierenden für den gewählten Kurs/Prüfung bestimmt die Höhe des Bonuses.",
                "selectedBonusSource": "Notenschlüssel für die ausgewälte Bonusquelle"
            },
            "examples": {
                "title": "Beispiele",
                "helpText": "(Du kannst eigene Szenarien ausprobieren, indem du die letzte Zeile bearbeitest)",
                "examPoints": "Prüfungspunkte",
                "examGrade": "Prüfungsnote",
                "bonusSourceStudentPoints": "Studierenden-Punkte der Bonusquelle",
                "bonusGrade": "Bonus",
                "finalPoints": "Finale<br>Punktzahl",
                "finalGrade": "Endnote",
                "any": "(Alle)",
                "exceedsMax": "Der Wert übersteigt das bestmögliche Ergebnis, deshalb wird er dort gedeckelt. Wenn das nicht gewollt ist, überprüfe die −/+ Auswahl noch einmal."
            },
            "formula": {
                "title": "Formel",
                "examPoints": "Prüfungspunkte",
                "examGrade": "Prüfungsnote",
                "bonusSourceStudentPoints": "Studierenden-Punkte der Bonusquelle",
                "bonusGrade": "Bonus",
                "finalPoints": "Finale<br/>Punktzahl",
                "finalGrade": "Endnote",
                "finalGradeLimit": "(Du kannst keine bessere Endnote als {{maxPossibleGrade}} bekommen)",
                "finalGradeFromPoints": "Die finale Punktzahl bestimmt die Endnote, indem sie mit dem normalen Notenschlüssel umgerechnet wird."
            },
            "title": "Bonus",
            "deleteQuestion": "Willst du den Bonus wirklich löschen?",
            "updated": "Bonus aktualisiert.",
            "created": "Bonus erstellt.",
            "deleted": "Bonus gelöscht.",
            "warnStrategyWeightMismatch": "Die von dir gewählte Kombination aus Bonusstrategie und Gewicht würde zu einer schlechteren Note für den Studierenden führen. Bitte überdenke deine Auswahl oben noch einmal."
        }
    }
}
