{
    "error": {
        "title": "Fehlerseite!",
        "http": {
            "400": "Ungültige Anfrage.",
            "401": "Du bist nicht authentifiziert, um auf diese Seite zuzugreifen.",
            "403": "Du hast nicht die nötigen Berechtigungen, um diese Seite anzuzeigen.",
            "404": "Die Seite existiert nicht.",
            "405": "Die verwendete Anfrage Methode ist für diese URL nicht erlaubt.",
            "409": "Es gab einen Konflikt bei der Bearbeitung Deiner Anfrage.",
            "500": "Interner Serverfehler."
        },
        "cannotDeleteYourself": "Du kannst nicht deinen eigenen Account löschen!",
        "fileUploadSavingError": "Fehler! Der Upload schlug fehl. Stelle sicher, dass eine Internetverbindung besteht!",
        "concurrencyFailure": "Ein:e Nutzer:in hat diese Daten zeitgleich mit dir geändert. Deine Änderungen wurden abgelehnt.",
        "validation": "Validierungsfehler auf dem Server.",
        "resultStringNull": "Fehler! Ein Ergebnistext ist erforderlich.",
        "resultStringTooLong": "Fehler! Der Ergebnistext ist zu lange (max. 255 Zeichen)",
        "scoreNull": "Fehler! Eine Bewertung is erforderlich.",
        "resultNotRated": "Fehler! Ein Ergebnis muss bewertet sein.",
        "submissionMissing": "Fehler! Die Abgabe ist nicht mehr mit dem Ergebnis verknüpft. Deine Änderungen wurden abgelehnt.",
        "resultAlreadyExists": "Es liegt bereits ein Ergebnis für diese Übung vor.",
        "scoreAndSuccessfulNotMatching": "Fehler! Nur ein Ergebnis mit 100% kann erfolgreich sein.",
        "feedbackDetailTextNull": "Fehler! Wenn Feedback vorhanden ist, müssen die Feedback Details ausgefüllt werden.",
        "quizAlreadyVisible": "Das Quiz ist bereits sichtbar.",
        "quizAlreadyStarted": "Das Quiz wurde bereits gestartet.",
        "quizNotEndedYet": "Das Quiz hat noch nicht geendet.",
        "quizAlreadyOpenForPractice": "Das Quiz ist bereits zur Übung geöffnet.",
        "unknownAction": "Diese Aktion kann nicht durchgeführt werden.",
        "groupNotFound": "Die von dir eingegebene Gruppe wurde nicht gefunden.",
        "studentNotFound": "Studierende:r konnte in diesem Kurs nicht gefunden werden.",
        "cantSaveFile": "Die hochgeladene Datei {{ fileName }} konnte nicht gespeichert werden.",
        "emptyFile": "Die hochgeladene Datei {{ fileName }} ist leer. Bitte überprüfe die Datei und versuche es erneut.",
        "externalSubmissionBeforeDueDate": "Externe Einreichungen können nur nach der Abgabefrist erstellt werden.",
        "externalSubmissionForQuizExercise": "Externe Einreichungen können nicht für Quiz Übungen erstellt werden.",
        "noSubmissions": "Nutzer:in existiert nicht oder es gibt keine Abgaben.",
        "feedbackCreditsNull": "Fehler! Wenn Feedback vorhanden ist, muss das Feedback eine Punktzahl haben.",
        "invalidGradeStepFormat": "Eine oder mehrere Notenstufen folgen nicht dem richtigen Format. Klicke auf das \"?\" für mehr Informationen.",
        "invalidGradeStepAdjacency": "Die Notenstufen bilden keinen gültigen Notenschlüssel ab. Klicke auf das \"?\" für mehr Informationen.",
        "emptyGradeSteps": "Die Notenstufen dürfen nicht leer sein. Klicke auf das \"?\" für mehr Informationen.",
        "textSubmissionTooLong": "Text Abgaben können höchstens 30.000 Zeichen lang sein.",
        "programmingExercisePolicyPresent": "Die Abgaberichtlinie konnte nicht zu der Programmieraufgabe hinzugefügt werden, da diese bereits eine Abgaberichtlinie hat.",
        "submissionPolicyHasId": "Die Abgaberichtlinie konnte nicht zu der Programmieraufgabe hinzugefügt werden, da die Abgaberichtlinie bereits eine ID hat.",
        "programmingExercisePolicyNotPresent": "Von der Programmieraufgabe konnte keine Abgaberichtlinie entfernt werden, da die Programmieraufgabe keine Richtlinie hat.",
        "submissionPolicyAlreadyEnabled": "Die Abgaberichtlinie konnte nicht aktiviert werden, da diese bereits aktiviert ist.",
        "submissionPolicyAlreadyDisabled": "Die Abgaberichtlinie konnte nicht deaktiviert werden, da diese bereits deaktiviert ist.",
        "submissionPolicyToggleFailedPolicyNotExist": "Für diese Programmieraufgabe konnte die Abgaberichtlinie nicht (de)aktiviert werden, da die Programmieraufgabe keine Abgaberichtlinie hat. ",
        "submissionPolicyActiveNull": "Abgaberichtlinien müssen aktiviert oder deaktiviert sein. Dieser Status darf nicht null sein.",
        "submissionPolicyUpdateFailedPolicyNotExist": "Die Abgaberichtlinie konnte nicht gespeichert werden, da die Programmieraufgabe keine Abgaberichtlinie hat!",
        "oneActivePlagiarismCheck": "Bitte warte bis die aktuelle Plagiatskontrolle in diesem Kurs abgeschlossen ist, bevor du eine weitere startest.",
        "internalServerError": "Interner Serverfehler",
        "server.not.reachable": "Server ist nicht erreichbar",
        "url.not.found": "Nicht gefunden",
        "NotNull": "Feld {{fieldName}} darf nicht leer sein!",
        "size": "Feld {{fieldName}} erfüllt nicht die minimalen/maximalen Längenanforderungen!",
        "userExists": "Login bereits vergeben!",
        "emailExists": "E-Mail wird bereits verwendet!",
        "idExists": "Ein neuer {{entityName}} kann noch keine ID haben",
        "ambiguousContext": "Ein neuer {{entityName}} muss einen eindeutigen Kontext haben",
        "invalid": {
            "template": {
                "build.plan.id": "Die Vorlagen-Build-Plan-ID scheint ungültig zu sein. Stelle bitte sicher, dass sie existiert und für Artemis zugänglich ist.",
                "repository.url": "Die Vorlagen-Repository-URL scheint ungültig zu sein. Stelle bitte sicher, dass sie existiert und für Artemis zugänglich ist."
            },
            "solution": {
                "build.plan.id": "Die Lösungs-Build-Plan-ID scheint ungültig zu sein. Stelle bitte sicher, dass sie existiert und für Artemis zugänglich ist.",
                "repository.url": "Die Lösungs-Repository-URL scheint ungültig zu sein. Stelle bitte sicher, dass sie existiert und für Artemis zugänglich ist."
            },
            "auxiliary.repository": {
                "id": "Die ID eines Hilfs-Repositories scheint gesetzt zu sein. Stelle bitte sicher, dass die ID nicht gesetzt ist.",
                "name": "Der Name von mindestens einem Hilfs-Repository ist ungültig oder dupliziert. Stelle bitte sicher, dass jeder Name gültig ist und es keine Duplikate gibt.",
                "checkout.directory": "Das Checkout-Verzeichnis von mindestens einem Hilfs-Repository ist ungültig oder dupliziert. Stelle bitte sicher, dass jedes Checkout-Verzeichnis gültig ist und es keine Duplikate gibt.",
                "description": "Die Beschreibung von mindestens einem Hilfs-Repository ist zu lang! Es sind maximal {{maxLength}} Zeichen erlaubt."
            },
            "testcases.weights": "Vor Deaktivierung der manuellen Bewertung muss für mindestens einen Testfall die Bewertungsgewichtung größer Null gesetzt werden.",
            "page.request": "Die Seitenanforderung scheint ungültig zu sein. Stelle bitte sicher, dass genügend {{entityName}}-Entitäten vorhanden sind, damit die Anforderungsseite erstellt werden kann."
        },
        "idNull": "Ungültige ID",
        "unexpectedError": "Ein unerwarteter Fehler ist aufgetreten: {{error}}",
        "manualCodeHintOperation": "Dieser Endpunkt erlaubt keine manuelle Bearbeitung von Codehinweisen.",
        "exerciseNotDefined": "Die Aufgabe ist nicht definiert.",
        "exerciseIdMismatch": "Die Aufgaben-IDs stimmen nicht überein.",
        "solutionEntryError": "Fehler beim Laden der extrahierten Aufgaben aus der Aufgabenstellung."
    }
}
