{
    "artemisApp": {
        "exerciseChatbot": {
            "popUpMessage": "Indem du fortfährst, erklärst du dich damit einverstanden, dass deine Interaktionen mit Iris von Microsoft und OpenAI verarbeitet werden, wobei die Datenübertragung außerhalb unseres Universitätsrechenzentrums erfolgt. Wenn du mit diesen Bedingungen nicht einverstanden bist, wähle bitte 'Ablehnen'. Um dies zu bestätigen und deinen Chat mit IrisBot zu beginnen, klick auf 'Akzeptieren'.",
            "inputMessage": "Schreib eine Nachricht...",
            "accept": "Akzeptieren",
            "decline": "Ablehnen",
            "title": "Iris: Deine virtuelle Programmierbegleiterin",
            "subtext": "iris ist ein LLM-basierter Chatbot, der dich durch deine Programmierübungen führt. Sie beantwortet Fragen und gibt Hilfestellungen.",
            "subheading1": "Datenverarbeitung & Einwilligung",
            "text1_1": "<b>Datenverarbeitung:</b> Deine Interaktionen mit Iris werden von Microsoft und OpenAI verarbeitet. Das bedeutet, dass die Informationen, die du mit Iris teilst, das Rechenzentrum unserer Universität verlassen.",
            "text1_2": "<b>Einwilligung:</b> Um Iris benutzen zu können, musst du die Einwilligungserklärung akzeptieren, die beim ersten Öffnen von Iris erscheint. Damit stimmst du zu, dass Microsoft und OpenAI deine Daten wie beschrieben verarbeiten dürfen.",
            "subheading2": "Die wichtigsten Funktionen von Iris",
            "text2_1": "<b>Programmierkenntnisse:</b> Iris kann deine Fragen zu Programmiersprachen, Syntax, Algorithmen, Datenstrukturen oder anderen spezifischen Themen beantworten. Sie kann auch Probleme in deinem Code erkennen und dir Tipps zur Verbesserung geben.",
            "text2_2": "<b>Tutoring-Fähigkeiten:</b> Iris kann dir komplexe Programmierkonzepte erklären und anschauliche Beispiele geben.",
            "text2_3": "<b>Kontextverständnis:</b> Im Gegensatz zu anderen LLM-basierten Chatbots kennt Iris den Programmcode, die Aufgabenstellung, die Buildresultate und die Logdaten. Das bedeutet, dass sie dir die Aufgabenstellung genauer erklären und dir Feedback zu deinem Code oder möglichen Buildfehlern geben kann.",
            "text2_4": "<b>Feedback:</b> Dein Feedback ist wichtig, um das Verhalten von Iris zu verbessern. Indem du bestimmte Antworten oder ganze Konversationen beurteilst, trägst du dazu bei, dass sich Leistung mit der Zeit zu verbessert.",
            "text2_5": "<b>Kommunikationsfähigkeiten:</b> Iris speichert deinen Chatverlauf, so dass du d eine Interaktion fortsetzen und auf frühere Nachrichten zurückgreifen kannst, wenn du Iris erneut öffnest.",
            "subheading3": "Boundaries & Limitations",
            "text3_1": "<b>No Solution:</b> Iris is designed to guide your learning process, which means she won't simply give you the complete solution to a task. Instead, she will help you by answering specific questions and offering hints to assist you in solving the task on your own.",
            "text3_2": "<b>No Off-Topic Conversations:</b> Iris's main focus is programming. Therefore, she won't answer questions that aren't related to programming or the current programming exercise you're working on.",
            "text3_3": "<b>No Organizational Information:</b> Iris won't provide information to organizational topics.",
            "subheading4": "Funktionen des Chat-Widgets",
            "text4_1": "<b>Schließen des Widgets:</b> Du kannst das Widget schließen, indem du auf den 'X'-Button (in der oberen rechten Ecke des Widgets) oder auf den 'Chatbot'-Button (unterhalb des Widgets) klickst.",
            "text4_2": "<b>Verschieben des Widgets:</b> Du kannst das Widget verschieben. Klicke und halte das Widget und ziehe es an die gewünschte Position.",
            "text4_3": "<b>Vergrößern und Verkleinern des Widgets:</b> Klicke und ziehe die Ränder des Widgets in verschiedene Richtungen, um die Größe zu ändern.",
            "text4_4": "<b>Vollbildmodus:</b> Du kannst das Widget im Vollbildmodus öffnen, indem du auf den Vollbildmodus-Button (in der oberen rechten Ecke des Widgets) klickst.",
            "supportText": "(Wenn du Probleme mit dem Iris-Widget oder bei der Interaktion mit Iris hast, erstelle bitte einen Issue auf GitHub https://github.com/ls1intum/Artemis)",
            "unreadMessages": "Ungelesene Nachrichten",
            "buttonTooltip": "Beginne mit Iris zu chatten!"
        }
    }
}
