{
    "featureOverview": {
        "title": "Onlineklausuren in Artemis",
        "featureDetails": "Featuredetails",
        "instructor": {
            "pageTitle": "Klausurfeatures für Lehrende",
            "featureOverview": "Features für Lehrende",
            "feature": {
                "createConductAssess": {
                    "title": "Klausur Erstellen, Durchführen und Bewerten",
                    "shortDescription": "Erstelle, durchführe und bewerte Klausuren innerhalb der Artemis-Plattform.",
                    "descriptionTextOne": "Artemis unterstützt jetzt einen Klausurmodus, der eine einzigartige Möglichkeit bietet, die Leistungen der Studierenden zu bewerten. Du kannst Klausuren für deinen Kurs erstellen und jeweils alle oder einige deiner Studierenden anmelden. Innerhalb der Klausur kannst du Programmier-, Modellierungs-, Text-, Datei-Upload- und Quizaufgaben einfügen oder bestehende Aufgaben importieren. Bevor du die Klausur für die Studierenden freigibst, kannst du Testläufe durchführen, um sicherzustellen, dass alles reibungslos verläuft. Definiere eine Arbeitszeit für die Klausur und passe sie bei Bedarf für einzelne Studierende an. Die Studierenden können frühzeitig abgeben.\n\nKeine stabile Internetverbindung? Artemis speichert alle Änderungen lokal und synchronisiert automatisch alle 30 Sekunden, um Probleme durch instabile Internetverbindungen zu vermeiden während der Durchführung der Klausur.\n\nSobald die Klausurdurchführung beendet ist, ist es Zeit die Abgaben zu bewerten. Dein Bewertungsteam startet die Bewertung über das Bewertungsdashboard, das auch den Fortschritt der Bewertung visualisiert.\n\nSobald alle Klausuren bewertet wurden, kannst du die Ergebnisse freigeben, sodass alle Studierenden ihr Ergebnis einsehen können. Wenn du glaubst, dass ein Fehler in der Bewertung ist, kannst du mit der Beschwerdefunktion eine erneute Überprüfung anfordern. Eine befugte Person, kann dann die spezifische Abgabe erneut bewerten und entscheiden, ob sie die Beschwerde akzeptiert oder ablehnt.\n\nDarüber hinaus erstellt Artemis auch einen statistischen Bericht über die Klausur, um die Leistungen der Studierenden zu bewerten und zu überprüfen.\n\nErstellen, durchführen & bewerten, alles innerhalb von Artemis!"
                },
                "configuration": {
                    "title": "Vollständig Konfigurierbar",
                    "shortDescription": "Konfiguriere die Klausur nach Bedürfnis. Studierenden-Import von CSV Dateien.",
                    "descriptionTextOne": "Artemis ermöglicht es, alle Aspekte einer Klausur zu konfigurieren. Du kannst den Namen der Klausur, die Modulnummer setzen, die prüfende Person und den Kursnamen festlegen. Außerdem kannst du den Zeitplan der Klausur frei nach deinen Bedürfnissen einstellen, indem du entscheidest, wann die Klausur für die Studierenden sichtbar wird, wann die Klausur automatisch beginnen und enden soll, wann die Ergebnisse veröffentlicht werden, sowie den Zeitraum, in dem die Studierenden ihre Ergebnisse überprüfen und sich ggf. beschweren können.\n\nDu kannst Aufgaben aus den Artemis-Aufgabentypen hinzufügen. Klausuraufgaben können mehrere Varianten haben und können als \"nicht obligatorisch\" markiert werden. Dies stellt sicher, dass jeder Studierende eine einzigartige Klausur erhält. Zusätzlich kannst du die Reihenfolge der Aufgaben bei der Klausur jedes Studierenden nach dem Zufallsprinzip festlegen, um die Betrug weiter zu erschweren.\n\nDu kannst Studierende per CSV-Import in großer Anzahl registrieren oder sie einzeln aus allen registrierten Nutzer:innen manuell auszuwählen. Zusätzlich kannst du auch einzelnen Studierenden mehr Zeit zuweisen."
                },
                "examMode": {
                    "title": "Zwei Klausurmodi verfügbar",
                    "shortDescription": "Wähle zwischen einer normalen Klausur oder einer Testklausur aus.",
                    "descriptionTextOne": "Artemis unterstützt zwei Klausurmodi. Die Durchführung von normalen Klausuren und Testklausuren. \n\nDer normale Klausurmodus eignet sich zur Durchführung von Semesterendklausuren. Studierende können die Klausur zwischen der eingestellten Arbeitszeit sehen und bearbeiten. Danach kannst du eine manuelle oder automatisierte Bewertung der studentischen Klausuren vornehmen. Die Ergebnisse werden zum eingestellten Datum veröffentlicht. \n\nTestklausuren bieten dir die Möglichkeit, den Studierenden eine Übungsmöglichkeit für die Semesterendklausur bereitzustellen. Der Hauptunterschied besteht darin, dass du ein Bearbeitungsfenster auswählst, innerhalb welches die Studierenden frei mit der Klausur beginnen können. Für die Bearbeitung haben die Studierenden dann die eingestellte Arbeitszeit zur Verfügung, die Klausur zu bearbeiten. Nach dem Abschicken werden den Studierenden direkt die automatisierte Bewertung für Programmier- und Quizaufgaben angezeigt. Eine manuelle Korrektur der Ergebnisse ist nicht notwendig."
                },
                "exerciseTypes": {
                    "title": "Verschiedene Aufgabentypen",
                    "shortDescription": "Programmier-, Modellierungs-, Text-, Datei-Upload- und Quizaufgaben.",
                    "descriptionTextOne": "Artemis unterstützt Programmier-, Modellierungs-, Text-, Datei-Upload- und Quiz-Aufgaben wie Multiple-Choice-, Drag-and-drop- und Lückentextfragen im Klausurmodus.\n\nBei den Programmieraufgaben entscheiden sich die Studierenden zwischen der Arbeit mit dem online Code-Editor oder sie können das Repository klonen und die Aufgabe in der integrierten Entwicklungsumgebung (IDE) ihrer Wahl bearbeiten. Artemis benutzt den integrierten und einfach zu bedienenden Apollon Editor für die Modellierungsaufgaben. Es unterstützt eine Vielzahl von Diagrammen, darunter Klassen-, Aktivitäts-, Objekt-, Anwendungsfall-, Kommunikations-, Komponenten-, Einsatzdiagramme, Petrinetze und Syntaxbäume. Die Studierenden können Modelle erstellen, indem sie Objekte intuitiv in den Editor ziehen und mit den entsprechenden Pfeilen verbinden. Durch die Vielfalt der verfügbaren Aufgabenarten erfüllt Artemis die Anforderungen der meisten Lehrveranstaltungen im Bereich der Softwaretechnik."
                },
                "exerciseVariants": {
                    "title": "Aufgaben Varianten",
                    "shortDescription": "Mache jede Klausur einzigartig, indem du jeder Aufgabe Varianten hinzufügst.",
                    "descriptionTextOne": "Artemis bietet die Möglichkeit, für jeden Studierenden eine individuelle Klausur zu erstellen. Du kannst Aufgabengruppen erstellen oder importieren, die mehrere Aufgaben enthalten. Die Anzahl der Aufgabengruppen spiegelt die Anzahl an Aufgaben in jeder Klausur wider. Bei der Erstellung der Klausur jedes Studierenden, wählt Artemis zufällig eine Aufgabe aus jeder Aufgabengruppe aus und kombiniert diese, um eine einzigartige Klausur für jeden Studierenden zu erstellen. Du kannst auch die Reihenfolge der Aufgaben nach dem Zufallsprinzip festlegen. Noch dazu kannst du zwischen obligatorischen und nicht obligatorischen Aufgaben unterscheiden."
                },
                "testRunConduction": {
                    "title": "Testläufe Durchführen",
                    "shortDescription": "Führe Testläufe durch, um verschiedene Varianten auszuprobieren.",
                    "descriptionTextOne": "Artemis bietet die Möglichkeit an, Testläufe zu erstellen. Ein Testlauf simuliert alle Schritte der Klausur: die Durchführung, die Bewertung und die Einsicht. Du kannst auswählen, welche Aufgaben du in den Testlauf einbeziehen möchtest und die Arbeitszeit festlegen. Dann kannst du mit der Durchführung beginnen und deine Klausur wie ein Studierender erleben. Nachdem du abgegeben hast, kannst du deine Klausur bewerten. Die Ergebnisse werden sofort in der Zusammenfassung des Testlaufs angezeigt, wo du auch die Beschwerden während einer Einsicht simulieren kannst. Schließlich kannst du auch auf die Beschwerden reagieren, um den Klausurprozess abzuschließen. \n\nTestläufe sind auch eine gute Möglichkeit, um dein Korrekturteam mit der Plattform und der Klausur vertraut zu machen!"
                },
                "sessionMonitoring": {
                    "title": "Überwachung der Klausur",
                    "shortDescription": "Überwache die Klausursitzung, um ungewöhnliche Aktivitäten zu identifizieren.",
                    "descriptionTextOne": "Ohne eine Aufsicht, kann es sich so anfühlen, als könntest du deine Studierenden nicht genau beobachten. Um dem entgegenzuwirken, beinhaltet Artemis eine Überwachung der Klausuren. Für alle Studierenden, die an der Klausur teilnehmen, generiert Artemis eine Klausursitzung. Die Klausursitzung enthält neben anderen Feldern, wann und wo die Klausur gestartet wurde, die öffentliche IP-Adresse und einen einzigartigen Fingerabdruck, der auf dem Browser und dem Betriebssystem basiert. Zusätzlich generiert die Klausur eine eindeutige Kennung, die mit jeder Anfrage gesendet wird. Studierende haben die Möglichkeit, während der Klausur zwischen den Computern zu wechseln und auch offline weiterzuarbeiten. Als Ausbilder haben Sie die Möglichkeit, alle Sitzungen und das Verhalten der Studierenden zu analysieren und verdächtig erscheinende Fälle zu markieren."
                },
                "plagiarismDetection": {
                    "title": "Plagiatserkennung",
                    "shortDescription": "Plagiatsversuche automatisch erkennen und kennzeichnen.",
                    "descriptionTextOne": "Artemis kann Lehrende dabei unterstützen, Plagiatsversuche zu erkennen. Dies geschieht, indem die Ähnlichkeiten zwischen allen studentischen Abgaben analysiert werden und diejenigen, die einen bestimmten Schwellenwert überschreiten, markiert werden. Mit dem integrierten Plagiat-Editor kannst du alle markierten Abgaben nebeneinander vergleichen und diejenigen Fälle bestätigen, die als echte Plagiatsversuche gelten. Du kannst zwischen verschiedenen Plagiatserkennungsstrategien wählen, um diejenige auszuwählen, die deinen Bedürfnissen entspricht. Lehrende haben auch die Möglichkeit, einen CSV-Bericht über akzeptierte und abgelehnte Plagiatsversuche zur weiteren Verarbeitung auf externen Systemen herunterzuladen.\n\n"
                },
                "anonymousAssessment": {
                    "title": "Anonyme Bewertung",
                    "shortDescription": "Anonymes Bewertungsverfahren durch Korrektur-Warteschlangen, um Vorurteile zu vermeiden.",
                    "descriptionTextOne": "Dein Bewertungsteam kann über das Bewertungs-Dashboard auf die Abgaben der Studierenden zugreifen. In diesem Dashboard können sie eine neue Abgabe anfordern, sofern eine für die Bewertung verfügbar ist. Alle Abgaben sind anonymisiert, um Vorurteile oder Bevorzugung von Personen zu vermeiden. Um die Genauigkeit und Konsistenz der Bewertung zu verbessern, kannst du Bewertungsanweisungen, Musterabgaben und Musterbewertungen definieren, um eine gemeinsame Basis für die Benotungserwartungen zu schaffen, bevor die Bewertung beginnt."
                },
                "automaticAssessment": {
                    "title": "Automatische Bewertung",
                    "shortDescription": "Automatische & halbautomatische Bewertung von allen unterstützten Aufgabentypen.",
                    "descriptionTextOne": "Artemis unterstützt die Korrektur mit automatischen und halb automatischen Bewertungen für verschiedene Aufgabentypen. Für Quizaufgaben kannst du die richtige Lösung im Voraus festlegen. Nach Abschluss der Klausur kannst du Artemis zur automatischen Bewertung aller Abgaben veranlassen. Für Programmieraufgaben kannst du eine Testsuite erstellen, die z.B. Struktur- und Verhaltenstests verwendet. Diese werden dann nach Klausurende automatisch für jede Abgabe eines Studierenden ausgeführt und entsprechend bewertet. Du kannst auch das Gewicht jedes Tests verändern und Bonuspunktevergeben. Zusätzlich kannst du statische Analyse-Tools verwenden, um deine Beurteilung zu unterstützen. Alle Regeln der statischen Analyse können unterschiedlich gewichtet werden, und du kannst Grenzen definieren, wie viele Punkte abgezogen werden sollen, wenn ein Fehler mehrmals auftritt. Schließlich kann die Bewertung der automatischen Programmieraufgaben überprüft und durch eine manuelle Bewertung bestätigt oder überschrieben werden. \n\nFür Text- und Modellieraufgaben kannst du automatische Korrekturvorschläge aktivieren. Artemis verwendet maschinelles Lernen, um ähnliche Elemente in allen Abgaben zu identifizieren. Artemis analysiert die ausgegebenen Bewertungen, um richtige und falsche Elemente zu identifizieren und den Bewertenden Vorschläge zu geben. Das Ziel ist es, den Aufwand der Bewertung zu reduzieren und die Konsistenz und Fairness zu erhöhen."
                },
                "reviewIndividualExams": {
                    "title": "Individuelle Klausuren Überprüfen",
                    "shortDescription": "Überprüfe die Klausuren der einzelnen Studierenden mit ihren Abgaben und Ergebnissen.",
                    "descriptionTextOne": "Während der Bewertungsprozess für Tutor:innen anonym ist, kannst du als Lehrkraft auf die Klausuren der einzelnen Studierenden und deren Zusammenfassung zugreifen und diese einsehen. Die Zusammenfassung einer Klausur enthält alle Lösungen des jeweiligen Studierenden zu den Aufgaben sowie die erreichten Punkte. Du kannst auch ihren Code einsehen, indem du den Link zu ihrer Repository benutzt. Dieses wird auch auf der Zusammenfassung inklusive dem letzten Commit-Hash angezeigt."
                },
                "assessmentMonitoring": {
                    "title": "Überwachung der Bewertung",
                    "shortDescription": "Behalte den Bewertungsfortschritt immer im Überblick durch das Bewertungs-Dashboard.",
                    "descriptionTextOne": "Über das Bewertungs-Dashboard habt ihr immer einen Überblick darüber, wie die Bewertung der Klausur verläuft. Dies wird durch einen intuitiven Fortschrittsbalken für jede Aufgabe der Klausur angezeigt, der genau darstellt, wie viele Abgaben noch bewertet werden müssen. Verliere keine Zeit und veröffentliche sofort die Ergebnisse, wenn alle Klausuren bewertet worden sind. Du kannst auch die Ergebnisseite ansehen, um Einblicke in die Ergebnisse der Klausur zu gewinnen."
                },
                "complaints": {
                    "title": "Online-Klausureinsicht Anbieten",
                    "shortDescription": "Studierende können ihre Klausur einsehen. Änderungen bei Beschwerden automatisch anwenden.",
                    "descriptionTextOne": "Nachdem die Ergebnisse veröffentlicht wurden, kannst du einen Zeitraum für die Einsicht der Studierenden festlegen. Alle Studierenden können die Klausur bequem am eigenen Computer einsehen und sich die Zeit nehmen, um die Bewertung zu verstehen. Sollten sie der Meinung sein, dass sie einen Fehler gefunden haben, können sie mit der Beschwerdefunktion eine Überprüfung beantragen. Alle Beschwerden werden gesammelt und können auf dem Bewertungsdashboard eingesehen werden. Die Beschwerden werden dann von einer dritten Person (d. h. eine andere als die ursprünglich Bewertende), beurteilt. Diese kann die Bewertung überprüfen und entscheiden, ob sie die Beschwerden akzeptiert oder ablehnt. Die angegebenen Punkte werden dann automatisch aktualisiert, einschließlich des Ergebnisses der Klausur."
                },
                "statistics": {
                    "title": "Statistiken Erstellen",
                    "shortDescription": "Statistiken erstellen und Einblicke in die Leistungen der Studierenden gewinnen.",
                    "descriptionTextOne": "Die Klausur ist vorbei, alle Klausuren wurden bewertet und die Beschwerden der Studierenden wurden ausgewertet. Was nun?\n\nDu kannst das Ergebnis der Klausur anhand der von Artemis generierten Statistiken auswerten. Überprüfe die Leistung der Studierenden anhand verschiedener Metriken wie Durchschnitt, Median und Standardabweichung. Überprüfen Sie die wahrgenommenen Schwierigkeiten der Studierenden bei jeder Aufgabe, um die Klausuren in Zukunft zu verbessern. Zusätzlich kannst du alle Ergebnisse in eine CSV-Datei herunterladen, um sie in externe Systeme zu exportieren und Diagramme und Grafiken zur weiteren Analyse zu erstellen."
                },
                "checklist": {
                    "title": "Checkliste Befolgen",
                    "shortDescription": "Verwende die Prüfungscheckliste, um jeden Schritt der Prüfung zu überwachen und sicherzustellen, dass er korrekt durchgeführt wird.",
                    "descriptionTextOne": "Die Durchführung einer Prüfung ist ein langer Prozess mit vielen möglichen Fehlerquellen. Artemis bietet dir eine Checkliste von der Erstellung der Übungen bis zum Export der Ergebnisse, die dir einen Überblick über jeden Schritt einer Prüfung gibt. Die Prüfungs-Checkliste enthält die nächste Aktion, die du bei einem Schritt durchführen musst, und fasst den bisherigen Fortschritt zusammen, damit du alle Aufgaben korrekt und vollständig ausführen kannst. Sie hat auch Navigationsschaltflächen, damit du schnell verwandte Aktionen durchführen oder den Fortschritt im Detail überprüfen kannst. Außerdem gibt es auf der Seite mit der Prüfungsliste eine kompakte Übersicht, mit der du die Vorbereitung, Durchführung und Korrektur von Prüfungen in der Liste überblicken kannst."
                },
                "gradeKey": {
                    "title": "Notenschlüssel Erstellen",
                    "shortDescription": "Erstelle einen Notenschlüssel mit benutzerdefinierten oder vorgegebenen Notenstufen für einen Kurs oder eine Prüfung.",
                    "descriptionTextOne": "Punkte sind hilfreich, um einzelne Übungen zu bewerten, aber am Ende eines Semesters möchten du und die Studierenden eine Note erhalten. Auf der Notenschlüssel-Seite kannst du für jeden Kurs und jede Prüfung einen Notenschlüssel festlegen und die Notenstufen definieren, indem du die Intervalle, die Mindestnote und die untere/obere Grenze angibst. Der Standard-Notenschlüssel kann auch mit einem einzigen Klick erstellt werden. Artemis kümmert sich dann automatisch um die Zuordnung von Noten zu Notenstufen oder Bonuspunkten und um die Berechnung der Ergebnisstatistik auf der Grundlage der Notenstufen."
                }
            }
        },
        "students": {
            "pageTitle": "Klausurfeatures für Studierende",
            "featureOverview": "Features für Studierende",
            "feature": {
                "localIDE": {
                    "title": "Verwende Deine IDE",
                    "shortDescription": "Klone die Aufgabe und arbeite an den Programmieraufgaben auf deiner IDE.",
                    "descriptionTextOne": "IDEs erhöhen die Produktivität der Programmierenden, indem sie die Aktivitäten des Software-Schreibens kombinieren: Editieren des Quellcodes, Erstellen von ausführbaren Dateien und Debugging. Zusätzlich können Nutzer:innen sie nach Belieben konfigurieren, um sie ihrem persönlichen Ansatz anzupassen. Für Onlineklausuren auf Artemis hast du die Möglichkeit, deine Programmieraufgabe zu klonen und sie in deiner IDE zu bearbeiten. Benutze den Klon-Button, hole dir den Link der Aufgabe und klone sie mit GIT-Befehlen. Wenn du fertig bist, kannst du einfach deine Änderungen pushen und mit der Arbeit an anderen Aufgaben fortfahren. Jeder Push löst ein kontinuierliches Integrationssystem aus, das deine Abgabe automatisch bewertet und Feedback gibt."
                },
                "codeEditor": {
                    "title": "Integrierter Code-Editor",
                    "shortDescription": "Schließe die Programmieraufgaben mit dem integrierten Code-Editor ab.",
                    "descriptionTextOne": "Für den Fall, dass du keinen Zugang zu einem Computer mit installierter IDE hast, oder du einfach nur schnell ein paar Änderungen vornehmen möchtest, bietet der Artemis-Klausurmodus einen integrierten Code-Editor, mit dem du die Programmieraufgaben erledigen kannst. Der Artemis-Code-Editor hat ein intuitives Layout, das einen Dateibrowser und Editor, einen Codebereich, die Aufgabenbeschreibung sowie eine Build-Log-Ausgabe zur Analyse deiner Abgaben enthält. Fehler werden direkt in der Zeile angezeigt, die sie verursacht hat, sodass du schnell eine Änderung vornehmen kannst, um alle Probleme zu beheben. Dein Fortschritt bei der Aufgabe wird automatisch mit jeder Abgabe aktualisiert."
                },
                "textEditor": {
                    "title": "Integrierter Texteditor",
                    "shortDescription": "Löse Textaufgaben mit dem integrierten Texteditor.",
                    "descriptionTextOne": "Um an Textaufgaben zu arbeiten, bietet Artemis einen integrierten Texteditor. Der Texteditor ist einfach zu bedienen und leicht zu navigieren. Es gibt keine Grenze für die zulässige Länge der Abgabe und er verfolgt automatisch die Anzahl der Wörter und Zeichen in deiner Abgabe."
                },
                "apollonEditor": {
                    "title": "Integrierter Model-Editor",
                    "shortDescription": "Erstelle komplexe Modelle einfach per Drag & Drop mit dem intuitiven Apollon-Editor.",
                    "descriptionTextOne": "Angetrieben vom Apollon-Editor unterstützt der Artemis-Klausurmodus das Modellieren von Aufgaben unterschiedlicher Art. Dazu gehören Klassen-, Aktivitäts-, Objekt-, Anwendungsfall-, Kommunikations-, Komponenten-, Verteilungsdiagramme, Petri-Netze und Syntaxbäume. Mit dem integrierten Apollon-Editor kannst du auf einfache Weise komplexe Modelle erstellen, die über eine intuitive Drag-and-drop-Benutzeroberfläche navigierbar sind."
                },
                "quizExercises": {
                    "title": "Quizaufgaben",
                    "shortDescription": "Löse Quizaufgaben in Form von Multiple-Choice-, Drag-and-Drop- und Lückentextfragen.",
                    "descriptionTextOne": "Der Artemis-Klausurmodus unterstützt Quizaufgaben die Multiple-Choice-, Drag-and-drop- und Lückentextfragen enthalten können. Artemis-Multiple-Choice-Fragen können eine oder mehrere Lösungen haben und die Bewertung kann so angepasst werden, dass zum Beispiel bei einer falschen Antwort keine Punkte abgezogen werden. Auf diese Weise kann es den exakten Bewertungsstil eurer Offline-Klausuren imitieren. Für Drag-and-drop-Fragen kannst du einfach das entsprechende Element an die passende Stelle ziehen. Für Lückentexte bekommst du Eingabefelder innerhalb eines Textes, die du mit deinen eigenen Worten ausfüllen kannst."
                },
                "login": {
                    "title": "LRZ Login",
                    "shortDescription": "Logge dich über dein LRZ-Konto ein. Kein spezielles Konto erforderlich.",
                    "descriptionTextOne": "Benutze die gleichen LRZ-Zugangsdaten, die du für alle Universitätsanwendungen verwendest, um auf Artemis zuzugreifen. Es ist nicht nötig, ein neues Konto zu erstellen und ein anderes Passwort zu verwalten! Logge dich mit deiner TUMID und deinem Passwort ein und du kannst loslegen."
                },
                "userInterface": {
                    "title": "Intuitive UI",
                    "shortDescription": "Navigiere mit Hilfe der intuitiven Benutzeroberfläche durch die Klausur.",
                    "descriptionTextOne": "Du führst die Klausur mit der Benutzeroberfläche des Artemis-Klausurmodus durch. Das Interface verbirgt alle anderen Funktionen von Artemis, um Ablenkungen zu vermeiden, und ermöglicht es dir, dich auf die Klausur selbst zu konzentrieren. Am oberen Rand zeigt eine Statusleiste den Status jeder Aufgabe an und verfolgt deinen Fortschritt bei jeder Aufgabe anhand einer Farbcodierung. Wenn du zum Beispiel ungespeicherte Änderungen vorgenommen hast, wird die jeweilige Aufgabe in der Statusleiste gelb hervorgehoben. Sobald du deinen Fortschritt speicherst oder er automatisch synchronisiert wird, wird er entsprechend angezeigt. Du kannst die Statusleiste auch benutzen, um zwischen den Aufgabe zu navigieren, indem du einfach auf die Aufgabe klickst.",
                    "descriptionTextTwo": "Für jeden Aufgabentypen wird rechts die Aufgabenstellung angezeigt. Auf der linken Seite findest du den jeweiligen Editor. Damit du im Quiz keine Frage verpasst, wird links eine Übersicht über alle Fragen angezeigt. Du kannst auf jede Frage klicken und die Ansicht wird entsprechend gescrollt. Wenn du die Klausur beendet hast, hast du die Möglichkeit, sie vorzeitig einzureichen. Ansonsten wird die Ansicht nach Ablauf der Zeit automatisch auf die Bestätigungsseite für das Klausurende aktualisiert und deine Änderungen werden automatisch synchronisiert. Nach dem Klausurende bekommst du eine Gnadenfrist von ein paar Minuten, um dein Klausurende zu bestätigen und die Klausur abzuschließen."
                },
                "conduction": {
                    "title": "Onlineklausur",
                    "shortDescription": "Klausuren auf Artemis durchführen.",
                    "descriptionTextOne": "Artemis unterstützt jetzt die Erstellung und Durchführung von Onlineklausuren, die alle in die Plattform integriert sind! Als Student*in hast du die Möglichkeit, an Onlineklausuren teilzunehmen, die die meisten bekannten Artemis-Aufgabentypen wie Programmier-, Modellierungs-, Text- und Quiz-Aufgaben wie Multiple-Choice-Fragen beinhalten können. Mit der intuitiven und übersichtlichen Benutzeroberfläche kannst du einfach durch die Aufgaben navigieren. Dein Fortschritt wird lokal gespeichert und alle 30 Sekunden synchronisiert, sodass du auch bei Ausfall der Internetverbindung offline weiterarbeiten kannst. Wenn du die Klausur abgegeben hast, hast du immer Zugriff auf die Zusammenfassung, die dir einen Überblick über deine Lösungen gibt. Die Klausur wird anonym bewertet, unterstützt durch die automatische und halb automatische Bewertung von Artemis, die du direkt von zu Hause aus einsehen kannst, ohne geografische Einschränkungen. Du kannst deine Klausur von überall auf der Welt durchführen und überprüfen."
                },
                "examMode": {
                    "title": "Zwei Klausurmodi",
                    "shortDescription": "Artemis bietet Klausuren und Testklausuren.",
                    "descriptionTextOne": "Artemis unterstützt zwei Klausurmodi. Die Durchführung von normalen Klausuren und Testklausuren. \n\nDer normale Klausurmodus wird für dier Durchführung von Semesterendklausuren verwendet. Als Studierender kannst du die Klausur zwischen der eingestellten Arbeitszeit sehen und bearbeiten. Die Ergebnisse werden zum eingestellten Datum veröffentlicht. \n\nTestklausuren bieten dir eine Übungsmöglichkeit für die Semesterendklausuren. Der Hauptunterschied besteht darin, dass du während des Bearbeitungsfensters zu einer beliebigen Zeit mit der Testklausur beginnen kannst. Für die Bearbeitung hast du dann die eingestellte Arbeitszeit zur Verfügung. Nach dem Abschicken bekommst du direkt die automatisierte Bewertung für Programmier- und Quizaufgaben angezeigt."
                },
                "offline": {
                    "title": "Offline Weiterarbeiten",
                    "shortDescription": "Arbeite offline weiter, wenn deine Verbindung unterbrochen wird.",
                    "descriptionTextOne": "Der Klausurmodus in Artemis toleriert Probleme mit der Internetverbindung. Falls du nicht verbunden bist, kannst du weiter an Text-, Quiz- und Modellierungsaufgaben arbeiten. Wenn sich deine Internetverbindung wiederherstellt, wird Artemis deine Lösung automatisch speichern. Dies ist möglich, da die Plattform alle 30 Sekunden versucht deine Lösung zu speichern, wenn du zwischen den Aufgaben navigierst, als auch wenn du auf Speichern klickst. Für Programmieraufgaben brauchst du nur online zu sein, wenn du mit deiner eigenen lokalen IDE arbeitest, wenn du das Repository klonst und wenn du deine Commits pushst (d.h. deine Lösung abschickst)."
                },
                "summary": {
                    "title": "Überblick auf deiner Abgabe",
                    "shortDescription": "Greife immer auf deine Zusammenfassung zu.",
                    "descriptionTextOne": "\"Was war deine Antwort auf Frage 2?\"\n\n- \"Ich kann mich nicht mehr erinnern, ich denke Option B\".\n\nMit Artemis kannst du auf deine persönliche Klausur zugreifen und deine Einsendung über die Zusammenfassungsseite der Klausur, die nach der Abgabe verfügbar wird, überprüfen. Die Zusammenfassung enthält eine Übersicht über alle deine Abgaben und zeigt sie in einer aggregierten Ansicht an. Zusätzlich enthält sie den letzten Commit-Hash sowie den Link zu deinem Repository, wo du den Code für Programmieraufgaben einsehen und analysieren kannst. Für den Fall, dass du die es lokal auf dem Gerät deiner Wahl speichern möchtest, bietet Artemis die Möglichkeit, die komplette Zusammenfassung als PDF Datei herunterzuladen."
                },
                "qualityAndFair": {
                    "title": "Qualität und Fairness der Bewertung",
                    "shortDescription": "Artemis ermöglicht eine anonyme Korrektur, unterstützt durch automatische Bewertungen.",
                    "descriptionTextOne": "Artemis ermöglicht ein anonymisiertes Bewertungsverfahren, um eine faire Bewertung zu ermöglichen, frei von Vorurteilen und Abweichungen zwischen den verschiedenen Bewertungen. Alle, die Aufgaben bewerten, müssen Beispielvorlagen und Lösungen durcharbeiten, bevor sie mit der Bewertung der Klausuren beginnen kann. Zusätzlich unterstützt die Plattform den Bewertungsprozess mit automatischen und halbautomatischen Bewertungen für alle unterstützten Aufgabentypen. Quiz- und Programmieraufgaben werden automatisch bewertet. Diese automatische Bewertung kann durch eine manuellen Bewertung erweitert werden, um die Genauigkeit der Bewertung weiter zu erhöhen. Noch dazu lernt Artemis durch maschinelles Lernen, welche Elemente richtig und welche falsch sind. Diese Funktion kann für Text- und Modellierungsaufgaben aktiviert werden. Wenn es aktiviert ist, schlägt es vor, wie die Elemente der Abgaben im Verlauf der weiteren Korrektur bewertet werden sollen. Ziel ist es hier, den Aufwand zu reduzieren und die Qualität und Fairness der Bewertung zu erhöhen."
                },
                "onlineReview": {
                    "title": "Online-Klausureinsicht",
                    "shortDescription": "Die Bewertung deiner Klausur von überall in der Welt überprüfen.",
                    "descriptionTextOne": "Nachdem die Ergebnisse veröffentlicht wurden, kannst du auf deine Klausur zugreifen und die Bewertung bequem von deinem Computer aus überprüfen. Nimm dir die Zeit, die Aufgabenstellung und die Bewertung wirklich zu analysieren, um zu verstehen, welche Fehler du gemacht hast. Es gibt keine Ortsbeschränkungen für die Einsicht, du kannst von überall darauf zugreifen! \n\nManchmal passieren auch Fehler bei der Klausurbewertung. Mithilfe der Beschwerdefunktion kannst du dich über eine Bewertung beschweren und einige Gründe angeben, warum du dich nicht richtig bewertet fühlst. Alle Beschwerden von Studierenden werden gesammelt und ein anderer Bewerte, hat die Möglichkeit, deine Beschwerde entweder anzunehmen oder abzulehnen. Wenn deine Beschwerde akzeptiert wird, werden deine Punkte automatisch aktualisiert!"
                },
                "browserCompatibility": {
                    "title": "Kompatibel Mit Allen Gängigen Browsern.",
                    "shortDescription": "Verwende Artemis in allen gängigen Browsern.",
                    "descriptionTextOne": "Der Artemis-Klausurmodus ist mit allen gängigen Browsern kompatibel, einschließlich Chrome, Safari, Edge und Opera. Wir bieten aktive Unterstützung für Google Chrome und Chromium-Browser."
                },
                "gradeKey": {
                    "title": "Notenschlüssel Anzeigen",
                    "shortDescription": "Sieh dir deine Endnote und die erreichte Note für einen Kurs oder eine Prüfung an, sobald eine neue Aufgabe benotet wurde.",
                    "descriptionTextOne": "Wenn ein Notenschlüssel für einen Kurs oder eine Prüfung definiert ist, kannst du ihn überprüfen und den Punkteschnitt für jede Bewertungsstufe sowie die zum Bestehen erforderliche Mindestpunktzahl einsehen. Notenschlüssel haben auch einen Bonuspunkte-Modus, der die erreichte Punktzahl in einen Bonus umwandelt. Du musst nicht bis zum Ende des Semesters warten, um den Notenschlüssel zu benutzen, sondern kannst jederzeit deine erreichte Note anhand der bisher durchgeführten und bewerteten Übungen überprüfen."
                }
            }
        }
    }
}
