{
    "featureOverview": {
        "title": "Online Klausuren in Artemis",
        "featureDetails": "Feature Details",
        "instructor": {
            "pageTitle": "Klausur Features für Instructors",
            "featureOverview": "Features für Instruktoren",
            "feature": {
                "integratedProcess": {
                    "title": "Klausur erstellen, durchführen und bewerten",
                    "shortDescription": "Erstelle, durchführe und bewerte alles innerhalb der Artemis-Plattform.",
                    "descriptionTextOne": "Artemis unterstützt jetzt den Klausurmodus, der eine einzigartige Möglichkeit bietet, die Leistungen der Studierenden zu bewerten. Du kannst so viele Klausuren für deinen Kurs erstellen wie du willst und alle oder einige deiner Studierenden anmelden. Innerhalb der Klausur kannst du beliebig viele Aufgaben aus allen bekannten Aufgabentypen der Artemis-Plattform einfügen, einschließlich Programmier-, Modellierungs-, Text- und Quiz-Übungen wie Multiple-Choice-Fragen. Führe so viele Testläufe durch, wie du möchtest, um sicherzustellen, dass alles für die Studierenden reibungslos abläuft. Die Studierenden sind auf eine definierbare Zeitspanne zur Durchführung ihrer Klausur und zum Einreichen beschränkt. Sie können zwischen den Aufgaben navigieren und sie in beliebiger Reihenfolge lösen.\n\nKeine stabile Internetverbindung? Kein Problem. Alle von den Studierenden vorgenommenen Änderungen werden lokal gespeichert und alle 30 Sekunden automatisch synchronisiert.\n\nSobald die Klausurdurchführung beendet ist, ist es Zeit für die Tutoren, die Abgaben zu bewerten. Die integrierte Bewertung erfolgt über das Tutor-Klausur-Dashboard, das den Fortschritt aller Tutoren zusammenfasst und so einen klaren Überblick bietet. Verabschiedet euch von der manuellen Rückverfolgung der Bewertungen und den Excel-Tabellen.\n\nWenn alle Klausuren bewertet wurden, können die Ergebnisse freigegeben werden und alle Studierenden können ihr Ergebnis einsehen. Wenn sie glauben, dass sie einen Fehler in ihrer Bewertung gefunden haben, können sie mit der Beschwerdefunktion eine erneute Überprüfung anfordern. Ein Tutor, der nicht der ursprüngliche Bewerter ist, kann dann die spezifische Abgabe erneut bewerten und entscheiden, ob er die Beschwerde akzeptiert oder ablehnt.\n\nDarüber hinaus erstellt Artemis auch einen statistischen Bericht über die Klausur, um die Leistungen der Studierenden zu bewerten und zu überprüfen.\n\nErstellen, durchführen & bewerten, alles innerhalb von Artemis!"
                },
                "configuration": {
                    "title": "Vollständig konfigurierbar",
                    "shortDescription": "Studenten import von .csv dateien. Konfiguriere die Prüfung nach Ihren Wünschen. Bearbeite die Arbeitszeit einzelner Schüler.",
                    "descriptionTextOne": "Artemis erlaubt es euch, alle Aspekte der Klausur nach euren Wünschen zu konfigurieren. Du kannst den Namen der Klausur ändern und die Modulnummer, den Prüfer und den Kursnamen festlegen. Außerdem kannst du den Zeitplan der Klausur frei nach deinen Bedürfnissen einstellen, indem du entscheidest, wann die Klausur für die Studierenden sichtbar wird, wann die Arbeitszeit beginnt und endet, wann die Ergebnisse veröffentlicht werden, sowie den Zeitraum, in dem die Studierenden ihre Ergebnisse überprüfen und sich ggf. beschweren können.\n\nFüge von allen Aufgabentypen von Artemis so viele Aufgaben hinzu, wie du willst. Du kannst die Aufgaben auch so einstellen, dass sie nicht obligatorisch sind und mehrere Varianten hinzufügen, um sicherzustellen, dass jede*r Studierende eine einzigartige Klausur hat.\n\nFür deinen Komfort haben wir auch die Möglichkeit eingebaut, Studierenden per .csv-Import massenweise zu registrieren oder sie aus allen auf Artemis registrierten Benutzern auszuwählen. Zusätzlich kannst du auch einzelne Klausuren für Studierenden, die mehr Zeit benötigen, anpassen."
                },
                "exerciseTypes": {
                    "title": "Verschiedene Aufgabentypen",
                    "shortDescription": "Füge eine Vielzahl von Aufgaben hinzu, z.B. Programmier-, Modellierungs, Text- und Multiple-Choice-Aufgaben.",
                    "descriptionTextOne": "Alle bekannten Aufgabentypen von Artemis werden im Klausurmodus unterstützt. Dazu gehören Programmier-, Modellierungs-, Text- und Quiz-Aufgaben wie Multiple Choice, Drag-and-drop und Lückentexte. Du kannst so viele Aufgaben zu einer Klausur hinzufügen, wie du möchtest.\n\nBei den Programmieraufgaben entscheiden sich die Studierenden zwischen der Arbeit mit dem integrierten Code-Editor oder sie können das Repository klonen und die Aufgabe in der IDE ihrer Wahl bearbeiten. Der Modellierungseditor für Modellierungsaufgaben wird mit dem Apollon-Editor betrieben. Du kannst zwischen einer Reihe von Modellierungsaufgaben wählen, darunter Klassen-, Aktivitäts-, Objekt-, Anwendungsfall-, Kommunikations-, Komponenten-, Verteilungsdiagramme, Petri-Netze und Syntaxbäume. Die Studierenden können diese Fragen beantworten, indem sie Elemente intuitiv per Drag-and-drop in den Editor ziehen und mit den entsprechenden Pfeilen verbinden. Bei all dieser Vielfalt gibt es für jeden Kurs die passende Aufgabenart!"
                },
                "exerciseVariants": {
                    "title": "Übungsvarianten hinzufügen",
                    "shortDescription": "Mache jede Studentenklausur einzigartig, indem du jeder Aufgabe Varianten hinzufügst",
                    "descriptionTextOne": "Möchtest du für jeden Studierenden eine einzigartige Klausur anbieten? Kein Problem! Du kannst Übungsgruppen erstellen, die mehrere Aufgaben enthalten. Definiere so viele Aufgabengruppen für eine Klausur, wie du willst. Wenn die Klausur für jeden Studierenden erstellt wird, wählt Artemis zufällig eine Aufgabe aus jeder Aufgabengruppe aus und kombiniert diese, um eine einzigartige Klausur für jeden Studierenden zu erstellen. Du kannst auch die Reihenfolge der Aufgaben nach dem Zufallsprinzip festlegen, wenn du das möchtest. Außerdem kannst du auch zwischen obligatorischen und nicht obligatorischen Aufgaben unterscheiden!"
                },
                "sessionMonitoring": {
                    "title": "Überwachung der Klausur",
                    "shortDescription": "Überwache die Klausursitzung, um ungewöhnliche Aktivitäten zu identifizieren.",
                    "descriptionTextOne": "Ohne eine physische Anwesenheit kann es sich so anfühlen, als könntest du deine Studierenden nicht genau beobachten. Um dem entgegenzuwirken, beinhaltet Artemis eine Überwachung der Klausuren. Für jeden Studierenden, der an der Klausur teilnimmt, generiert Artemis eine Prüfungssitzung. Die Prüfungssitzung enthält neben anderen Feldern, wann und wo die Klausur gestartet wurde, die öffentliche IP-Adresse und einen einzigartigen Fingerabdruck, der auf dem Browser und dem Betriebssystem basiert.  Zusätzlich generiert die Klausur eine eindeutige Kennung, die mit jeder Anfrage gesendet wird. Durch diese Funktion kann Artemis eine sichere und faire Klausurdurchführung gewährleisten und gleichzeitig den Studierenden die Freiheit geben, gegen zufällige Ereignisse wie Internet- oder Computerausfälle vorzugehen. Sie haben die Möglichkeit, während der Klausur zwischen den Computern zu wechseln und auch offline weiterzuarbeiten. Als Ausbilder haben Sie die Möglichkeit, alle Sitzungen und das Verhalten der Studierenden zu analysieren und verdächtig erscheinende Fälle zu markieren."
                },
                "plagiarismDetection": {
                    "title": "Automatische Plagiatserkennung",
                    "shortDescription": "Plagiatsversuche automatisch erkennen und kennzeichnen.",
                    "descriptionTextOne": "Artemis kann Plagiatsversuche automatisch erkennen. Dies geschieht, indem die Ähnlichkeiten zwischen allen studentischen Abgaben analysiert werden und diejenigen, die einen bestimmten Schwellenwert überschreiten, markiert werden. Mit dem integrierten Plagiat-Editor kannst du alle markierten Abgaben nebeneinander vergleichen und diejenigen Fälle bestätigen, die als echte Plagiatsversuche gelten. Du kannst zwischen verschiedenen Strategien der Plagiatserkennung wählen, um diejenige auszuwählen, die deinen Bedürfnissen entspricht. Instruktoren haben auch die Möglichkeit, einen .csv-Bericht über akzeptierte und abgelehnte Plagiatsversuche zur weiteren Verarbeitung auf externen Systemen herunterzuladen."
                },
                "assessment": {
                    "title": "Integrierte anonyme Bewertung",
                    "shortDescription": "Automatische Bewertung von Programmier- und Quiz-, halbautomatische Bewertung von Text- und Modellierungsaufgaben.",
                    "descriptionTextOne": "Automatische Bewertung von Programmieraufgaben & Quizaufgaben.\nHalbautomatische Bewertung von Textaufgaben & Modellierungsaufgaben.\nDie Tutoren können auf die Klausur-Abgaben der Studierenden über das Tutor-Klausur-Dashboard zugreifen. In diesem Dashboard können sie eine neue Abgabe anfordern, solange eine für die Bewertung verfügbar ist. Alle Abgaben sind anonymisiert, um Vorurteile zu vermeiden. Du kannst Bewertungsanweisungen, Beispielabgaben und Beispielbewertungen definieren, um die Genauigkeit und Konsistenz der Tutoren zu verbessern!",
                    "descriptionTextTwo": "Zusätzlich unterstützt Artemis alle Tutoren mit automatischen und halb automatischen Bewertungen für verschiedene Aufgabentypen. Für Quizaufgaben kannst du die richtige Lösung festlegen. Nach Abschluss der Klausur kannst du alle Abgaben bewerten, die dann automatisch ausgewertet werden. Für Programmieraufgaben kannst du eine Testsuite erstellen, indem du zum Beispiel Struktur- und Verhaltenstests verwendest. Diese werden dann nach Klausurende automatisch für jede Abgabe eines Studierenden ausgeführt und entsprechend bewertet. Du kannst dich auch dafür entscheiden, das Gewicht jedes Tests zu verändern und Bonuspunkte zu vergeben. Zusätzlich kannst du statische Analyse-Tools verwenden, um deine Beurteilung weiter zu unterstützen. Alle Regeln können unterschiedlich gewichtet werden, und du kannst Grenzen definieren, wie viele Punkte abgezogen werden sollen, wenn ein Fehler mehrmals auftritt. Schließlich können deine Tutoren die Bewertung der automatischen Programmieraufgabe überprüfen und die Bewertung überschreiben oder bestätigen. Text- und Modellierungsaufgaben werden durch ein trainierbares halb automatisches System unterstützt, das wiederkehrende Muster erkennen und Hinweise geben kann, wie ein bestimmter Abschnitt bewertet werden sollte.\nMit diesen Werkzeugen wird deine nächste Klausur im Handumdrehen benotet!"
                },
                "assessmentMonitoring": {
                    "title": "Überwachung des Bewertungsfortschritts",
                    "shortDescription": "Tutor-Dashboard für Korrektur-Warteschlangen und Übersicht Fortschrittsverfolgung.",
                    "descriptionTextOne": "Über das Tutor-Dashboard habt ihr immer einen Überblick darüber, wie die Bewertung der Klausur verläuft. Dies wird durch einen intuitiven Fortschrittsbalken für jede Aufgabe der Klausur angezeigt, der genau darstellt, wie viele Abgaben noch darauf warten, bewertet zu werden. Verliere keine Zeit und veröffentliche sofort die Ergebnisse, wenn alle Klausuren bewertet worden sind. Du kannst auch die Klausuren einzelner Studierenden einsehen oder die Seite mit den Ergebnissen durchsehen, um Rückmeldung über den Ausgang der Klausur zu erhalten."
                },
                "complaints": {
                    "title": "Online Klausureinsicht",
                    "shortDescription": "Beschwerden von Studierenden überprüfen und Änderungen automatisch anwenden",
                    "descriptionTextOne": "Lange Schlangen, überfüllte Räume voller Studierenden, die ängstlich darauf warten, ihre Klausuren zu wiederholen, Tutoren, die darum kämpfen, die Bewertung ihrer Kommilitonen zu rationalisieren. Klausureinsichten sind keine angenehme Erfahrung für die Tutoren, Instruktoren und Studierenden gleichermaßen. Mit dem Artemis-Klausurmodus gehört all dies der Vergangenheit an. Nachdem die Ergebnisse veröffentlicht wurden, kannst du einen Zeitraum für die Einsicht der Studierenden festlegen. Die Studierenden können ihre Klausur bequem von ihrem Computer aus einsehen und sich Zeit nehmen, um die Bewertung der Tutoren wirklich zu verstehen. Sollten sie der Meinung sein, dass sie einen Fehler gefunden haben, können sie mit der Beschwerdefunktion eine Überprüfung beantragen.\nAlle Beschwerden werden gesammelt und können auf dem Tutor-Klausur-Dashboard eingesehen werden. Jede Beschwerde kann von jedem Tutor beurteilt werden, mit Ausnahme des ursprünglichen Bewerters. Der Tutor kann die Bewertung überprüfen und entscheiden, ob er die Anmerkungen des Studierenden akzeptiert oder ablehnt. Die angegebenen Punkte werden dann automatisch aktualisiert, einschließlich des Ergebnisses der Klausur."
                },
                "statistics": {
                    "title": "Statistiken Erstellen",
                    "shortDescription": "Erstellung von Statistiken und Einblicke in die Leistungen der Studierenden gewinnen",
                    "descriptionTextOne": "Die Klausur ist vorbei, alle Klausuren wurden bewertet und die Beschwerden der Studierenden ausgewertet. Was nun?\n\nDu kannst das Ergebnis der Klausur anhand der von Artemis generierten Statistiken auswerten. Überprüfe die Leistung der Studierenden anhand verschiedener Metriken wie Durchschnitt, Median und Standardabweichung. Überprüfen Sie die wahrgenommenen Schwierigkeiten der Studierenden bei jeder Aufgabe, um die Klausuren in Zukunft zu verbessern. Zusätzlich kannst du alle Ergebnisse in eine .csv-Datei herunterladen, um sie in externe Systeme zu exportieren und Diagramme und Grafiken zur weiteren Analyse zu erstellen."
                }
            }
        },
        "students": {
            "pageTitle": "Klausur Features für Studenten",
            "featureOverview": "Features für Studenten",
            "feature": {
                "localIDE": {
                    "title": "Verwende deine eigene IDE",
                    "shortDescription": "Klone die Aufgabe und arbeite an den Programmierübungen auf deiner eigenen IDE.",
                    "descriptionTextOne": "Genießt du die Vertrautheit, mit dem IDE deiner Wahl zu arbeiten? Stört es dich, wenn du gezwungen bist, Online-Code-Editoren für Programmieraufgaben zu benutzen? Wir denken das auch, deshalb erlauben wir dir für Onlineklausuren auf Artemis, das Aufgaben-Repository zu klonen und daran zu arbeiten, wie es dir gefällt! Benutze den Klon-Button, um den Link der Aufgabe zu erhalten und klone sie mit GIT-Befehlen. Wenn du fertig bist, kannst du einfach deine Änderungen pushen und mit der Arbeit an anderen Aufgaben fortfahren. Jeder Push löst ein kontinuierliches Integrationssystem aus, das deinen Code erstellt und die automatisierten Tests und statischen Code-Analyse-Tools ausführt, um gegebenenfalls Feedback zu geben."
                },
                "codeEditor": {
                    "title": "Integrierter Code-Editor",
                    "shortDescription": "Schließe die Programmierübung mit dem integrierten Code-Editor ab.",
                    "descriptionTextOne": "Für den Fall, dass du keinen Zugang zu einem Computer mit installierter IDE hast, oder du einfach nur schnell ein paar Änderungen vornehmen möchtest, bietet der Artemis-Klausurmodus einen integrierten Code-Editor, mit dem du die Programmieraufgaben erledigen kannst. Der Artemis-Code-Editor hat ein intuitives Layout, das einen Dateibrowser und Editor, einen Codebereich, die Aufgabenbeschreibung sowie eine Build-Log-Ausgabe zur Analyse deiner Abgaben enthält. Fehler werden direkt in der Zeile angezeigt, die sie verursacht hat, sodass du schnell eine Änderung vornehmen kannst, um alle Probleme zu beheben. Dein Fortschritt bei der Aufgabenstellung wird automatisch mit jeder deiner Abgaben aktualisiert."
                },
                "textEditor": {
                    "title": "Integrater Text Editor",
                    "shortDescription": "Löse Textaufgaben mit dem integrierten Texteditor.",
                    "descriptionTextOne": "Löse Textaufgaben mit dem integrierten Texteditor. Viel mehr ist nicht nötig. Der Texteditor ist einfach zu bedienen und leicht zu navigieren. Er funktioniert genau so, wie man es erwarten würde. Es gibt keine Grenzen für die maximal zulässige Länge und er verfolgt automatisch die Anzahl der Wörter und Zeichen in deiner Abgabe."
                },
                "apollonEditor": {
                    "title": "Integrater Model Editor",
                    "shortDescription": "Erstelle komplexe Modelle einfach per Drag & Drop mit dem intuitiven Apollon-Editor.",
                    "descriptionTextOne": "Angetrieben vom Apollon-Editor unterstützt der Artemis-Klausurmodus das Modellieren von Aufgaben unterschiedlicher Art. Dazu gehören Klassen-, Aktivitäts-, Objekt-, Anwendungsfall-, Kommunikations-, Komponenten-, Verteilungsdiagramme, Petri-Netze und Syntaxbäume. Mit dem integrierten Apollon-Editor kannst du auf einfache Weise komplexe Modelle erstellen, die über eine intuitive Drag-and-drop-Benutzeroberfläche navigierbar sind. "
                },
                "quizExercises": {
                    "title": "Quiz Aufgaben",
                    "shortDescription": "Löse Quizaufgaben in Form von Multiple-Choice-, Drag-and-Drop- und Lückentextfragen.",
                    "descriptionTextOne": "Multiple-Choice-Aufgaben sind eine der häufigsten Aufgabenarten bei Klausuren. Der Artemis-Klausursmodus unterstützt auch diese in Form von Quiz-Aufgaben. Quiz-Aufgaben sind viel mehr als nur einfache Multiple-Choice-Aufgaben. Artemis-Multiple-Choice-Fragen können eine oder mehrere Lösungen haben und die Bewertung kann so angepasst werden, dass zum Beispiel bei einer falschen Antwort keine Punkte abgezogen werden. Auf diese Weise kann es den exakten Bewertungsstil eurer Tutoren und Instruktoren für Offline-Klausuren imitieren. Aber Quiz-Aufgaben können auch andere Formen annehmen als nur Multiple-Choice! Artemis unterstützt auch Drag&Drop-Fragen und kurze Antwortfragen. Für Drag&Drop-Fragen kannst du einfach das entsprechende Element an die entsprechende Stelle ziehen. Für kurze Antwortfragen bekommst du Eingabefelder innerhalb eines Textes, die du mit deinen eigenen Worten ausfüllen kannst."
                },
                "login": {
                    "title": "LRZ Login",
                    "shortDescription": "Logge dich über dein LRZ-Konto ein. Kein spezieller Account erforderlich.",
                    "descriptionTextOne": "Benutze die gleichen LRZ-Zugangsdaten, die du für alle Universitätsanwendungen verwendest, um auf Artemis zuzugreifen. Es ist nicht nötig, einen neuen Account zu erstellen und ein anderes Passwort zu verwalten! Logge dich mit deiner TUMID und deinem Passwort ein und du kannst loslegen."
                },
                "userInterface": {
                    "title": "Intuitive Benutzeroberfläche",
                    "shortDescription": "Navigieren Sie mit Hilfe der intuitiven Benutzeroberfläche durch die Klausur.",
                    "descriptionTextOne": "Führt die Klausur mit der intuitiven Benutzeroberfläche des Artemis-Klausurmodus durch. Das Interface ist nur auf die Klausur fokussiert und verbirgt alle anderen Funktionen. Oben hast du eine Statusleiste, die den Status jeder Aufgabe anzeigt. Diese wird deinen Fortschritt für jede Aufgabe verfolgen und entsprechend anzeigen. Klausuren können anstrengend sein. Um dich vom technischen Aspekt der Durchführung zu entlasten, wird dein aktueller Status intuitiv durch Farbcodierung angezeigt. Sobald du nicht gespeicherte Änderungen vorgenommen hast, ändert sich die Statusleiste. Sobald du deinen Fortschritt speicherst oder er automatisch synchronisiert wird, wird er entsprechend angezeigt. Du kannst die Statusleiste auch benutzen, um zwischen den Aufgaben zu navigieren, indem du einfach auf die Übung klickst.",
                    "descriptionTextTwo": "Für jeden Aufgabentypen wird rechts die Aufgabenstellung angezeigt. Auf der linken Seite findest du den jeweiligen Editor. Damit du im Quiz keine Frage verpasst, wird links eine Übersicht über alle Fragen angezeigt. Du kannst auf jede Frage klicken und die Ansicht wird entsprechend gescrollt. Wenn du die Prüfung beendet hast, hast du die Möglichkeit, sie vorzeitig einzureichen. Ansonsten wird die Ansicht nach Ablauf der Zeit automatisch auf die Bestätigungsseite für das Klausurende aktualisiert und deine Änderungen werden automatisch synchronisiert. Nach dem Klausurende bekommst du eine Gnadenfrist von ein paar Minuten, um dein Klausurende zu bestätigen und die Prüfung abzuschließen."
                },
                "conduction": {
                    "title": "Onlineklausur",
                    "shortDescription": "Klausuren auf Artemis durchführen.",
                    "descriptionTextOne": "Artemis unterstützt jetzt die Erstellung und Durchführung von Onlineklausuren, die alle in die Plattform integriert sind! Als Student*in hast du die Möglichkeit, an Onlineklausuren teilzunehmen, die alle bekannten Artemis-Aufgaben wie Programmier-, Modellierungs-, Text- und Quiz-Aufgaben wie Multiple-Choice-Fragen beinhalten können. Mit der intuitiven und übersichtlichen Benutzeroberfläche kannst du einfach durch die Aufgaben navigieren. Dein Fortschritt wird lokal gespeichert und alle 30 Sekunden synchronisiert, sodass du auch bei Ausfall der Internetverbindung offline weiterarbeiten kannst. Wenn du die Klausur abgegeben hast, hast du immer Zugriff auf die Zusammenfassung, die dir einen Überblick über deine Lösungen gibt. Die Tutoren bewerten deine Klausur anonym, unterstützt durch die automatische und halb automatische Bewertung von Artemis, die du direkt von zu Hause aus einsehen kannst. Keine Warteschlangen und kein Zeitdruck mehr während der Klausur, nehmt euch die Zeit, eure Lösung und die Bewertung des Tutors zu analysieren. Haben wir erwähnt, dass es keine geografischen Einschränkungen gibt? Richtig, du kannst deine Klausur von überall auf der Welt durchführen und überprüfen."
                },
                "summary": {
                    "title": "On Demand Prüfungszusammenfassung",
                    "shortDescription": "Greife immer auf deine Zusammenfassung zu.",
                    "descriptionTextOne": "\"Was war deine Antwort auf Frage 2?\"\n- \"Ich kann mich nicht mehr erinnern, ich denke Option B\".\n\nWer hat während seines Studiums noch nie ein solches Gespräch erlebt? Mit dem Artemis-Klausurmodus brauchst du deine Antworten nicht noch einmal zu erraten, da du immer Zugriff auf die Zusammenfassung deiner Klausur hast. Die Zusammenfassung enthält eine Übersicht aller deiner Aufgabenabgaben und zeigt sie in einer gesammelten Ansicht an. Möchtest du den Code deiner Programmieraufgabe überprüfen? Kein Problem, die Zusammenfassung enthält sowohl den letzten Commit-Hash als auch den Link zu deinem Repository, wo du den Code einsehen und analysieren kannst."
                },
                "onlineReview": {
                    "title": "Online Klausureinsicht",
                    "shortDescription": "Siehe die Bewertung deiner Klausur ein ohne Ortsbeschränkung.",
                    "descriptionTextOne": "Lange Schlangen, vollgestopfte Räume voller Studierenden, die ängstlich darauf warten, ihre Klausuren einzusehen, Tutoren, die darum kämpfen, die Bewertung deiner Kommilitonen zu rationalisieren. Klausureinsichten sind keine angenehme Erfahrung für die Tutoren, Instruktoren und Studierenden gleichermaßen. Mit dem Artemis-Klausurmodus gehört all dies der Vergangenheit an. Nachdem die Ergebnisse veröffentlicht wurden, kannst du auf deine Klausur zugreifen und die Bewertung bequem von deinem eigenen Computer aus bei dir zu Hause überprüfen. Nimm dir die Zeit, die Aufgabenstellung und die Bewertung wirklich zu analysieren, um zu verstehen, welche Fehler du gemacht hast. Es gibt keine Ortsbeschränkungen für die Einsicht, du kannst von überall darauf zugreifen! \n\nManchmal können sogar Tutoren Fehler machen. Mithilfe der Beschwerdefunktion kannst du dich über eine Bewertung beschweren und einige Gründe angeben, warum du dich nicht richtig bewertet fühlst. Alle Beschwerden von Studierenden werden gesammelt und ein anderer Tutor als der ursprüngliche Bewerter hat die Möglichkeit, deine Beschwerde entweder anzunehmen oder abzulehnen. Wenn deine Beschwerde akzeptiert wird, werden deine Punkte automatisch aktualisiert!"
                },
                "browserCompatibility": {
                    "title": "Kompatibel mit allen gängigen Browsern.",
                    "shortDescription": "Verwende Artemis auf allen gängigen Browsern.",
                    "descriptionTextOne": "Der Artemis-Klausurmodus ist mit allen gängigen Browsern kompatibel, einschließlich Chrome, Safari, Edge und Opera. Wir bieten aktive Unterstützung für Google Chrome und Chromium-Browser."
                }
            }
        }
    }
}
