{
    "tour": {
        "modelingExercise": {
            "editorArea": {
                "headline": "Modellierungsaufgabe ",
                "content": "Hier auf dieser Seite sollst du eine Modellierungsaufgabe lösen. Auf der linken Seite siehst du eine karierte Fläche - die Editierfläche - auf welche du die UML Elemente, die auf neben der Editierfläche aufgelistet sind, per Drag and Drop hinzufügen kannst."
            },
            "addEditUmlElement": {
                "headline": "UML Elemente hinzufügen und bearbeiten",
                "content": "Um UML Elemente hinzuzufügen, musst du nur eines der aufgelisteten UML Elemente neben der Editierfläche per Drag and Drop auf die Editierfläche ziehen. Du kannst das UML Element, indem du das Element per Doppelklick auswählst."
            },
            "createAssociation": {
                "headline": "Beziehungen erstellen und bearbeiten",
                "content": "Um eine Beziehung hinzuzufügen, wähle die Ausgangsklasse mit einem Klick aus und erkenne die vier blaue Halbkreise. Das sind die möglichen Verbindungspunkte für Beziehungen. Klicke und halte einen dieser Punkte gedrückt und ziehe die Maus auf einen anderen blauen Halbkreis, um eine Beziehung zu erstellen. Du kannst den Typ der Beziehung ändern, indem du das Element per Doppelklick auswählst und den gewünschten Typ auswählst"
            },
            "executeTasks": {
                "headline": "Modelierungsaufgabe.",
                "content": "Löse die unten angebene Aufgabe, um zum nächsten Schritt zu gelangen.",
                "personClass": "Erstelle die UML Klasse <tt>Person</tt> mit dem Attribut <tt>name: String</tt>",
                "studentClass": "Erstelle die UML Klasse <tt>Student</tt> mit dem Attribut <tt>major: String</tt> und der Methode <tt>visitLecture()</tt>.",
                "association": "Stelle sicher, dass <tt>Student</tt> eine Subklasse von <tt>Person</tt> ist."
            },
            "submit": {
                "headline": "Reiche deine Lösung ein",
                "content": "Du kannst deine Lösung hier einreichen und dann auf deine Bewertung warten.",
                "hint": "Du kannst mehrmals bis zur Deadline abgeben. Deine Bewertung ergibt sich immer aus der letzten Abgabe."
            },
            "finishedTasks": {
                "headline": "Herzlichen Glückwunsch",
                "content": "Herzlichen Glückwunsch! Du hast deine erste Modelierungsaufgabe erfolgreich abgeschlossen."
            }
        }
    }
}
