{
    "tour": {
        "courseAdministration": {
            "assessmentDashboardButton": {
                "headline": "Bewertungs-Dashboard",
                "content": "Im <tt>Bewertungs-Dashboard</tt> kannst du die Abgaben von Studierenden einsehen und bewerten."
            }
        },
        "assessmentDashboard": {
            "overview": {
                "headline": "Übersicht",
                "content": "Hier findest du die Statistiken über deine <tt>Bewertungen</tt> und die <tt>Beschwerden</tt> und <tt>Feedbackanfragen</tt> über deine Bewertungen."
            },
            "showFinished": {
                "headline": "Beendete Übungen anzeigen",
                "content": "Beendete Übungen werden nicht initial in der unteren Tabelle angezeigt. Um alle Übungen, einschließlich der beendeten, anzuzeigen, musst du die Checkbox <tt>Beendete Übungen anzeigen</tt> selektieren."
            },
            "exerciseTable": {
                "headline": "Tabelle aller Übungen",
                "content": "Diese Tabelle listet alle Übungen des aktuellen Kurses auf und zeigt Informationen zum <tt>Aufgabentyp</tt>, <tt>Titel der Übung</tt>, <tt>Status</tt> deines Bewertungsprozesses und das <tt>Einreichungsfrist</tt> der Übung und der Bewertung."
            },
            "gradingProcess": {
                "headline": "Bewertungsprozess",
                "content": "Dieser Graph visualisiert deinen aktuellen Bewertungsprozess und markiert alle Knoten in grün, wenn der dazugehörige Prozessschritt erledigt ist: <ol><li>Lese die Bewertungsanleitung</li><li>Übe an Beispieleinreichungen (wenn vorhanden)</li><li>Bewerte Einreichungen von Studierenden</li><li>Evaluiere die Beschwerden und Feedbackanfragen der Studierenden</li></ol>"
            },
            "exerciseDashboardButton": {
                "headline": "Aufgaben-Dashboard",
                "content": "Nun gehen wir ins Aufgaben-Dashboard und schauen uns die Aufgabendetails und Abgaben der Studierenden an."
            }
        },
        "exerciseAssessmentDashboard": {
            "instructions": {
                "headline": "Anleitung",
                "content": "Dieser Abschnitt enthält die <tt>Aufgabenstellung</tt>, <tt>Beispiel Lösung</tt> und <tt>Bewertungsanweisungen</tt> der Übung. Bitte lies sie dir genau durch und fahre mit dem nächsten Schritt fort."
            },
            "instructionsButton": {
                "headline": "Bestätigung",
                "content": "Klicke auf diesen Button und bestätige, dass du die Anleitung gelesen und verstanden hast."
            },
            "readExampleSubmission": {
                "headline": "Beispielabgaben ansehen",
                "content": "Klick hier, um eine Beispielabgabe für eine Textaufgabe und deren Bewertung anzusehen."
            },
            "assessExampleSubmission": {
                "headline": "Beispielabgabe bewerten",
                "content": "Klick hier, um an deiner ersten Bewertung für eine Textaufgabe zu arbeiten."
            },
            "submissionsAndComplaints": {
                "headline": "Abgaben der Studierenden",
                "content": "Die Abgaben der Studierenden, die noch nicht bewertet sind, werden nach der Einreichungsfrist der Übung hier angezeigt."
            },
            "assessSubmissions": {
                "headline": "Bewertung von Abgaben der Studierenden",
                "content": "Um eine Bewertung zu starten, musst du auf den Button <tt>Neue Bewertung starten</tt> klicken. Wir haben den Button hier für Tutorialzwecke deaktiviert."
            }
        },
        "exampleRead": {
            "readSubmission": {
                "headline": "Beispielabgabe",
                "content": "Das ist eine Beispielaufgabe, bei der bereits drei Textblöcke zur Bewertung markiert sind."
            },
            "readAssessment": {
                "headline": "Beispielbewertung",
                "content": "Das ist eine Beispielbewertung der Abgabe. Jeder markierte Textblock wurde mit der Punktzahl '1' bewertet."
            },
            "confirm": {
                "headline": "Bestätigen",
                "content": "Bestätige, wenn du das Beispiel gelesen und verstanden hast."
            }
        },
        "exampleAssessment": {
            "addAssessment": {
                "headline": "Beispielabgabe bewerten",
                "content": "In diesem Schritt fängst du mit der Bewertung der Abgabe an. Befolge dafür die folgende Anleitung:",
                "task": "Markiere den Text eines Software Patterns und klicke und bewerte ihn. Wiederhole diesen Schritt für die übrigen zwei Patterns. Am Ende sollten es drei markierte Textblöcke geben."
            },
            "addScore": {
                "headline": "Punktzahl hinzufügen",
                "content": "Nun kannst du für jedes Bewertungselement eine Punktzahl und einen Feedbacktext hinterlegen.",
                "task": "Gib jedem Bewertungselement die Punktzahl '1'."
            },
            "submit": {
                "headline": "Bewertung einreichen",
                "content": "Jetzt kannst du deine Bewertung einreichen."
            },
            "back": {
                "headline": "Tutorial für Beispielbewertungen abschließen",
                "content": "Navigiere zum Aufgaben-Dashboard zurück, um dieses Tutorial abzuschließen."
            }
        }
    }
}
