{
    "tour": {
        "courseOverview": {
            "welcome": {
                "headline": "Willkommen in Artemis",
                "subHeadline": "(Automatic Assessment Management System for Interactive Learning)",
                "content": "Artemis ist eine Lernplattform die dir ermöglicht, Programmierübungen in interaktiven Lernsessions zu lösen."
            },
            "overviewMenu": {
                "headline": "Kursübersicht",
                "content": "Auf dieser Seite bekommst du eine Übersicht über alle deine Kurse."
            },
            "courseAdminMenu": {
                "headline": "Kursadministration",
                "content": "Hier kannst du deine Kurse und Übungen administrieren und verwalten."
            },
            "adminMenu": {
                "headline": "Server-Administration",
                "content": "Hier bekommst du einen Einblick in die Anwendungsadministration."
            },
            "notificationMenu": {
                "headline": "Deine Benachrichtigungen",
                "content": "In diesem Dropdown kannst du die Benachrichtigungen über neue Übungen einsehen."
            },
            "accountMenuClick": {
                "headline": "Persönliche Einstellungen",
                "content": "Klicke auf deinen Login, um das Menü für deine persönlichen Einstellungen anzuzeigen."
            },
            "accountMenu": {
                "headline": "Persönliche Einstellungen",
                "content": "In diesem Menü kannst du die Anzeigesprache einstellen, die aktuelle Tour nochmals wiederholen oder dich aus Artemis ausloggen."
            },
            "course": {
                "headline": "Deine aktuellen Kurse",
                "content": "Du bist für diesen Kurs angemeldet. Später kannst du dir die Kursdetailseite genauer anschauen, indem du auf diese Kachel klickst."
            },
            "courseFooter": {
                "headline": "Nächste fällige Übungsabgabe",
                "content": "Hier siehst du welche Übung in den nächsten Tagen abgeschlossen werden soll."
            },
            "courseClick": {
                "headline": "Kursdetail einsehen",
                "content": "Klicke nun diese Kachel an, um auf die Kursdetailseite zu gelangen."
            },
            "register": {
                "headline": "Melde dich für andere Kurse an",
                "content": "Du kannst auf dieser Seite einsehen, ob du dich für weitere Kurse anmelden kannst."
            },
            "contact": {
                "headline": "Kontaktiere das Artemis Team",
                "content": "Du kannst dich gerne an uns wenden, um Feedback zu geben, neue Features vorzuschlagen oder Fehler zu melden.",
                "hint": "Wenn du einen Beitrag zu Artemis leisten willst, dann schaue auf unserer <a href='https://github.com/ls1intum/Artemis' target='_blank'>Github Seite</a> vorbei und erstelle deinen ersten Pull Request."
            }
        }
    }
}
