{
    "tour": {
        "programmingExercise": {
            "codeEditor": {
                "fileBrowser": {
                    "headline": "Datei Browser",
                    "content": "Im Datei Browser findest die Struktur des Projekts mit allen Ordnern und Dateien. Du kannst hier auch eigene Ordner und Dateien anlegen."
                },
                "exerciseFile": {
                    "headline": "Klassendatei",
                    "content": "Klick hier auf die Klassendatei, damit sie sich im Programmiereditor öffnet."
                },
                "monacoEditor": {
                    "headline": "Programmiereditor",
                    "content": "Nun wird dir der Quellcode im Programmiereditor angezeigt. Du kannst dir das <tt>TODO</tt> durchlesen und bereits versuchen, dieses zu lösen. Alternativ kannst du auch in dieser Demo schon beliebigen Code einfügen. Wenn du damit fertig bist, dann klicke auf weiter."
                },
                "saveChanges": {
                    "headline": "Änderungen speichern",
                    "content": "Du kannst deine Änderungen im Programmiereditor nun speichern, indem du auf <tt>Speichern</tt> klickst."
                },
                "submitChanges": {
                    "headline": "Änderungen absenden",
                    "content": "Wenn du mit deinem Code zufrieden bist, dann kannst du deinen ersten Stand einreichen, indem du auf <tt>Absenden</tt> klickst.",
                    "hint": "Hier noch ein kleiner Hinweis: Du kannst bis zur Einreichungsfrist beliebig oft eine neue Lösung einreichen. Das heißt, du kannst deine Aufgaben einzeln lösen und danach einreichen."
                }
            },
            "buildLoading": {
                "headline": "Build und Tests",
                "content": "Nachdem du deine Abgabe eingereicht hast, werden Build und Tests von Artemis automatisch gestartet."
            },
            "buildStatus": {
                "headline": "Buildstatus",
                "content": "Hier kannst jetzt den Buildstatus einsehen, und erkennen, wie hoch der Anteil an bestandenen Tests ist und somit welche (Teil-)Aufgaben erfolgreich gelöst wurden und welche nicht.",
                "hint": "Es können zusätzliche Tests nach der Einreichungsfrist ausgeführt werden. Das heißt, auch wenn alle aktuell angezeigten Tests erfolgreich durchgelaufen sind, wird die Aufgabe nicht zwangsläufig mit voller Punktzahl bewertet. Überprüfe deine Implementierung daher genau, bevor du sie final einreichst."
            },
            "testCases": {
                "headline": "Feedback",
                "content": "Hier kannst du das Feedback zu deiner gesamten Abgabe einsehen. Versuche alle Fehler zu beheben, um die Programmieraufgabe erfolgreich zu bestehen."
            },
            "testSuccess": {
                "headline": "Aufgabe gelöst",
                "content": "Hier siehst du, dass du eine Aufgabe erfolgreich gelöst hast und alle Tests erfolgreich durchgelaufen sind."
            },
            "testFailure": {
                "headline": "Aufgabe ungelöst",
                "content": "Hier kannst du die Testfälle der einzelnen Aufgaben einsehen, die noch nicht erfolgreich durchgelaufen sind."
            },
            "umlSuccess": {
                "headline": "Überprüfe deine Implementierung anhand des UML-Diagramms",
                "content": "Nun kannst du einsehen, ob du das UML Klassendiagramm erfolgreich implementiert hast!"
            },
            "umlFailure": {
                "headline": "Überprüfe die fehlgeschlagenen Tests in deinem UML-Diagramm",
                "content": "Nun kannst du einsehen, welche Tests erfolgreich durchgelaufen sind und welche noch fehlschlagen."
            },
            "resolveTasks": {
                "headline": "Übung abschließen",
                "content": "Öffne Eclipse wieder und löse die übrigen Aufgaben, um diese Übung erfolgreich abzuschließen."
            },
            "reviewResult": {
                "headline": "Überprüfe dein Ergebnis",
                "content": "Überprüfe, ob alle Tests erfolgreich durchgelaufen sind."
            },
            "exerciseSuccess": {
                "headline": "Herzlichen Glückwunsch!",
                "content": "Du hast hiermit deine erste Programmieraufgabe auf Artemis gelöst!"
            }
        }
    }
}
