{
    "tour": {
        "tutorCourseDashboard": {
            "overview": {
                "headline": "Übersicht",
                "content": "Hier siehst du eine Übersicht deiner Bewertungen und eingehenden Beschwerden und Feedbackanfragen."
            },
            "exerciseTable": {
                "headline": "Übungentablle",
                "content": "Diese Tabelle zeigt alle aktiven Übungen dieses Kurses an. Um die beendeten Übungen anzuzeigen musst du nur die Checkbox <tt>Beendete Übungen anzeigen</tt> klicken, welche direkt über dieser Tabelle abgebildet ist."
            },
            "gradingProcess": {
                "headline": "Bewertungsprozess",
                "content": "Dieser Graph visualisiert deinen aktuellen Bewertungsstatus für diese Übung."
            },
            "exerciseDashboardButton": {
                "headline": "Aufgaben Dashboard",
                "content": "Lass uns nun zum Aufgaben Dashboard navigieren um die Details der Übung und der Studentenabgaben einzusehen."
            }
        },
        "tutorExerciseDashboard": {
            "instructions": {
                "headline": "Instruktionen",
                "content": "Dieser Bereich enthält die  <tt>Aufgabenstellung</tt>, <tt>Beispiellösung</tt> und <tt>Bewertungskriterien</tt> dieser Übung. Bitte lies dir diese genau durch und fahre dann mit dem nächsten Schritt fort."
            },
            "instructionsButton": {
                "headline": "Bestätigung",
                "content": "Wenn du die Instruktionen gelesen und verstanden hast, dann klicke auf diese Taste und bestätige dies hiermit."
            },
            "studentSubmissions": {
                "headline": "Studentenabgaben",
                "content": "In dieser Tabelle werden die Abgaben der Studenten angezeigt."
            },
            "startAssessment": {
                "headline": "Neue Bewertung starten",
                "content": "Wenn du diese Abgabe bewerten möchtest, dann klicke einfach auf <tt>Neue Bewertung starten</tt>.",
                "hint": "Wenn du die Bewertung startest, dann wird diese Abgabe von dir gesperrt. So wird sichergestellt, dass andere Tutoren nicht mehr auf diese Abgabe zugreifen können, während du an der Bewertung arbeitest. In diesem Tutorial haben wir deshalb diese Bewertungsfunktion deaktiviert."
            }
        },
        "exampleAssessment": {
            "modelingExercise": {
                "headline": "Modelingsaufgaben bewerten",
                "content": "Du kannst die verschiedenen Teilelemente der Modelierung bewerten, indem du auf sie klickst. Die unten aufgeführte Animation zeigt, wie das funktioniert. Wenn du mit der Bewertung fertig bist, kannst du die Bewertung einreichen."
            },
            "textExercise": {
                "headline": "Textaufgaben bewerten",
                "content": "Du kannst den Textblock, den du bewerten willst, per Doppelklick markieren und auf <tt>bewerten</tt> klicken, um Punktzahl und Feedback hinzuzufügen. Die unten aufgeführte Animation zeigt, wie das funktioniert. Wenn du mit der Bewertung fertig bist, kannst du die Bewertung einreichen.",
                "task": "Select a text block and an <tt>Assess</tt> button will appear"
            }
        }
    }
}
