{
    "tour": {
        "modelingExercise": {
            "editorArea": {
                "headline": "Modellierungsaufgabe ",
                "content": "Auf dieser Seite kannst du eine Modellierungsaufgabe lösen. Wir werden dir nun zeigen, wie das funktioniert."
            },
            "addEditUmlElement": {
                "headline": "UML Elemente hinzufügen und bearbeiten",
                "content": "Um UML Elemente hinzuzufügen, musst du eines der aufgelisteten UML Elemente per Drag-and-Drop auf die Editierfläche ziehen.",
                "hint": "Du kannst das UML Element per Doppelklick auswählen und editieren."
            },
            "createAssociation": {
                "headline": "Beziehungen erstellen und bearbeiten",
                "content": "Wähle die Ausgangsklasse aus, damit vier blaue Halbkreise erscheinen. Klicke und halte einen dieser Punkte gedrückt und ziehe die Maus auf einen anderen blauen Halbkreis, um eine Beziehung zu erstellen.",
                "hint": "Du kannst den Typ der Beziehung ändern, indem du das Element per Doppelklick auswählst."
            },
            "executeTasks": {
                "headline": "Modellierungsaufgabe.",
                "content": "Löse die unten angegebene Aufgabe, um zum nächsten Schritt zu gelangen.",
                "personClass": "Erstelle die UML Klasse <tt>Person</tt> mit dem Attribut <tt>name: String</tt>",
                "studentClass": "Erstelle die UML Klasse <tt>Student</tt> mit dem Attribut <tt>major: String</tt> und der Methode <tt>visitLecture()</tt>.",
                "association": "Stelle sicher, dass <tt>Student</tt> eine Subklasse von <tt>Person</tt> ist."
            },
            "submit": {
                "headline": "Reiche deine Lösung ein",
                "content": "Du kannst deine Lösung hier einreichen und dann auf deine Bewertung warten.",
                "hint": "Du kannst mehrmals bis zur Einreichungsfrist abgeben. Deine Bewertung ergibt sich immer aus der letzten Abgabe."
            }
        }
    }
}
