{
    "artemisApp": {
        "lti": {
            "home": {
                "title": "LTI-Konfiguration"
            },
            "initializationError": "Die Initialisierung deines Benutzers wurde gestartet aber dein LTI-Konto wurde möglicherweise nicht korrekt erstellt. Bitte benachrichtige deine Übungsleitung falls du dein Artemis-Passwort bisher nicht erhalten hast.",
            "initialization": {
                "header": "LTI Benutzer Initialisierung",
                "body": {
                    "welcome": "Herzlich Willkommen bei Artemis! Wir haben automatisch ein Konto für dich erstellt.",
                    "passwordLabel": "Dein Passwort",
                    "passwordHint": "Merk dir das Passwort gut. Du wirst es benötigen um dich manuell einzuloggen oder für unsere Programmieraufgaben.<br>Wenn du dein Passwort vergessen hast oder ändern möchtest kannst du es auf der Login-Seite zurücksetzen. Du kannst das Passwort auch sofort ändern:",
                    "passwordChange": "Passwort ändern",
                    "confirm": "Bestätigen"
                }
            },
            "startExercise": "<strong>Herzlich Willkommen bei Artemis!</strong> Klicke auf den Button <i>Aufgabe starten</i>!",
            "lti": "LTI",
            "configurationForExercise": "LTI Konfiguration der Übung {{ title }}",
            "ltiId": "LTI ID",
            "ltiKey": "LTI Key",
            "ltiSecret": "LTI Geheimnis",
            "ltiLaunchUrl": "LTI Start URL",
            "ltiLaunchTarget": "LTI Startziel",
            "scored": "Bewertet",
            "requestUsername": "Benutzernamen anfordern",
            "requestEmail": "E-Mail des Benutzers anfordern",
            "customParameters": "Benutzerdefinierte Parameter",
            "requireExistingUser": "Vorhandener Benutzer erforderlich",
            "lookupByEmail": "Benutzer per E-Mail suchen",
            "launchTargetTooltip": "Das empfohlene 'Launch Target' ist 'New Window', um eine optimale Benutzererfahrung zu gewährleisten",
            "requestUserEmailTooltip": "Die E-Mail des Benutzers muss gesendet werden, da sie von Artemis benötigt wird, um den Benutzer zu erstellen oder zu finden",
            "requireExistingUserTooltip": "Wenn ausgewählt, erfordert das Starten der Übung einen bestehenden Benutzer in Artemis. Wenn abgewählt, kann ein Benutzer beim ersten Start erstellt werden, wenn er noch nicht existiert",
            "lookupUserByEmailTooltip": "Wenn ausgewählt, versucht Artemis einen vorhandenen Benutzer mit der angegebenen E-Mail Adresse zu finden"
        }
    }
}
