{
    "artemisApp": {
        "lti": {
            "home": {
                "title": "LTI-Konfiguration"
            },
            "initializationError": "Die Initialisierung deines Benutzers wurde gestartet aber dein LTI-Konto wurde möglicherweise nicht korrekt erstellt. Bitte benachrichtige deine Übungsleitung falls du dein Artemis-Passwort bisher nicht erhalten hast.",
            "initialization": {
                "header": "LTI Benutzer Initialisierung",
                "body": {
                    "welcome": "Herzlich Willkommen bei Artemis! Wir haben automatisch ein Konto für dich erstellt.",
                    "passwordLabel": "Dein Passwort",
                    "passwordHint": "Merk dir das Passwort gut. Du wirst es benötigen um dich manuell einzuloggen oder für unsere Programmieraufgaben.<br>Wenn du dein Passwort vergessen hast oder ändern möchtest kannst du es auf der Login-Seite zurücksetzen. Du kannst das Passwort auch sofort ändern:",
                    "passwordChange": "Passwort ändern",
                    "readAndUnderstood": "Ich habe die obigen Informationen gelesen und verstehe, dass ich das oben angezeigte Passwort speichern muss.",
                    "confirm": "Bestätigen"
                }
            },
            "version10": "LTI 1.0",
            "version13": "LTI 1.3",
            "dynamicRegistrationUrl": "Dynamische Registrierung URL",
            "deepLinkingUrl": "Deep Linking URL",
            "keysetUrl": "Keyset URL",
            "generalConfiguration": "Allgemeine Konfiguration",
            "userPrefix": "Nutzer-Präfix",
            "registrationId": "Registrierung ID",
            "clientId": "Client ID",
            "authorizationUri": "Authorization URI",
            "tokenUri": "Token URI",
            "jwkSetUri": "JWKSet URI",
            "exercises": "Aufgaben",
            "startExercise": "<strong>Herzlich Willkommen bei Artemis!</strong> Klicke auf den Button <i>Aufgabe starten</i>!",
            "ltiSuccessLoginRequired": "LTI Übung erfolgreich gestartet. Bitte melde dich als Nutzer:in {{user}} an.",
            "lti": "LTI",
            "configurationForCourse": "LTI Konfiguration der Kurs {{ title }}",
            "ltiKey": "LTI Key",
            "ltiSecret": "LTI Geheimnis",
            "lti10LaunchUrl": "LTI 1.0 Start URL",
            "lti13LaunchUrl": "LTI 1.3 Start URL",
            "ltiLaunchTarget": "LTI Startziel",
            "scored": "Bewertet",
            "requestUsername": "Benutzernamen anfordern",
            "requestEmail": "E-Mail des Benutzers anfordern",
            "customParameters": "Benutzerdefinierte Parameter",
            "requireExistingUser": "Vorhandener Benutzer erforderlich",
            "lookupByEmail": "Benutzer per E-Mail suchen",
            "userPrefixTooltip": "Präfix für die neuen Benutzer, die für diesen Kurs erstellt werden. Es wird empfohlen, einen Wert zu verwenden, der die Benutzer eindeutig als Teil dieses Kurses identifiziert.",
            "dynamicRegistrationTooltip": "Sie können diese URL verwenden, um automatisch eine LTI 1.3 Plattform mit diesem Kurs zu registrieren.",
            "launchTargetTooltip": "Das empfohlene 'Launch Target' ist 'New Window', um eine optimale Benutzererfahrung zu gewährleisten",
            "requestUserEmailTooltip": "Die E-Mail des Benutzers muss gesendet werden, da sie von Artemis benötigt wird, um den Benutzer zu erstellen oder zu finden",
            "requireExistingUserTooltip": "Wenn ausgewählt, erfordert das Starten der Übung einen bestehenden Benutzer in Artemis. Wenn abgewählt, kann ein Benutzer beim ersten Start erstellt werden, wenn er noch nicht existiert",
            "lookupUserByEmailTooltip": "Wenn ausgewählt, versucht Artemis einen vorhandenen Benutzer mit der angegebenen E-Mail Adresse zu finden",
            "edit": {
                "configurationForCourse": "LTI Konfiguration der Kurs {{ title }} bearbeiten",
                "ltiKeyTooltip": "Für LTI 1.0 verwendeter Schlüssel. Sie können diesen Wert frei ändern, es wird jedoch empfohlen, den automatisch generierten Wert zu verwenden.",
                "ltiSecretTooltip": "Für LTI 1.0 verwendetes Geheimnis. Sie können diesen Wert frei ändern, es wird jedoch empfohlen, den automatisch generierten Wert zu verwenden.",
                "registrationIdTooltip": "ID, die zur Identifizierung der Registrierung der Lernplattform verwendet wird. Diese muss für alle Kurse eindeutig sein. Sie können diesen Wert frei ändern, es wird jedoch empfohlen, den automatisch generierten Wert zu verwenden.",
                "clientIdTooltip": "Es ist möglich, dieses Feld und die folgenden URI-Felder manuell zu konfigurieren, aber es wird dringend empfohlen, den Dynamic Registration Service zur automatischen Konfiguration zu verwenden.",
                "form": {
                    "userPrefix": {
                        "forbidden": "Nutzer Präfix darf keine Sonderzeichen beinhalten."
                    }
                }
            }
        },
        "lti13": {
            "launch": {
                "title": "Aufgabe starten",
                "launching": "Am starten...",
                "launchFailed": "Die Übung konnte nicht gestartet werden. Bitte versuchen Sie es später noch einmal oder kontaktieren Sie den Administrator."
            },
            "dynamicRegistration": {
                "title": "Dynamische Registrierung",
                "registering": "Am registrieren",
                "registeredSuccessfully": "Kurs erfolgreich registriert",
                "registerFailed": "Fehler bei der dynamischen Registrierung"
            },
            "missingConfigurationWarning": "Fehlende Werte in der LTI1.3-Konfiguration. Starts werden nicht funktionieren."
        }
    }
}
