{
    "arTeMiSApp": {
        "modelingEditor": {
            "title": "Modellierungseditor",
            "problemStatement": "<strong>Problemstellung:</strong>",
            "maxScore": "<strong>Max. Punktzahl: {{maxScore}}</strong>",
            "saveSuccessful": "Dein Diagramm wurde erfolgreich gespeichert!",
            "submitSuccessful": "Dein Diagramm wurde erfolgreich abgesendet! Du kannst dein Diagramm nun nicht mehr bearbeiten. Bitte warte auf dein Feedback.",
            "submitSuccessfulWithAssessment": "Dein Diagramm wurde erfolgreich abgesendet! Du kannst dein Diagramm nun nicht mehr bearbeiten. Dein Feedback wird unten angezeigt.",
            "submitDeadlineMissed": "Dein Diagramm wurde erfolgreich abgesendet! Du kannst dein Diagramm nun nicht mehr bearbeiten. Bitte warte auf dein Feedback. Da du die Deadline verpasst hast wird deine Bewertung nicht gezählt.",
            "empty": "Ein leeres Diagramm kann nicht abgegeben werden.",
            "autoSubmit": "Die Übung ist zu Ende. Du kannst dein Diagramm nun nicht mehr bearbeiten.",
            "error": "Ein Fehler ist aufgetreten. Bitte versuche es später noch einmal.",
            "assessment": {
                "title": "Bewertung",
                "noAssessment": "Es liegt noch keine Bewertung vor.",
                "instructions": "Wählen Sie im Editor Elemente aus, um die Bewertung zu filtern.",
                "element": "Element",
                "score": "Punkte"
            },
            "helpModal": {
                "help": "Hilfe",
                "title": "So verwendet man den Modellierungseditor",
                "createElement": {
                    "title": "Elemente hinzufügen",
                    "text": "Um ein Element hinzuzufügen, ziehen Sie einfach eines der Elemente von der rechten Seite per Drag & Drop in den Editorbereich auf der linken Seite."
                },
                "createRelationship": {
                    "title": "Beziehungen hinzufügen",
                    "text": "Um eine Beziehung hinzuzufügen, wählen Sie die Ausgangsklasse mit einem Klick aus und Sie sehen vier blaue Halbkreise. Das sind die möglichen Verbindungspunkte für Beziehungen. Klicken und halten Sie einen dieser Punkte gedrückt und ziehen Sie die Maus auf einen anderen blauen Halbkreis, um eine Beziehung zu erstellen."
                },
                "updateElement": {
                    "title": "Elemente/Beziehungen editieren",
                    "text": "Um ein Element oder eine Beziehung zu bearbeiten, doppelklicken Sie darauf und es öffnet sich ein Popup, in dem Sie die Eigenschaften der Klasse bearbeiten können, z.B. Name, Typ, Attribute, Methoden, etc."
                },
                "deleteElement": {
                    "title": "Elemente/Beziehungen löschen",
                    "text": "Um ein Element oder eine Beziehung zu löschen, wählen Sie diese mit einem Klick aus und drücken Sie entweder <code>Entfernen</code> oder die <code>Rücktaste</code> auf Ihrer Tastatur."
                },
                "moveElement": {
                    "title": "Elemente verschieben",
                    "text": "Um ein Element zu verschieben, wählen Sie dieses mit einem Klick aus und verwenden Sie entweder die Pfeiltasten Ihrer Tastatur oder bewegen Sie sie per Drag & Drop."
                },
                "resizeElement": {
                    "title": "Größe von Elementen verändern",
                    "text": "Um die eines Elements zu verändern, bewegen Sie per Drag & Drop die rechte, untere Ecke des Elements."
                },
                "reconnectRelationship": {
                    "title": "Beziehungen neu verbinden",
                    "text": "Um eine Beziehung neu zu verbinden, bewegen Sie per Drag & Drop eine der Beziehungsenden."
                },
                "select": {
                    "title": "Multi-Selektion",
                    "text": "Wenn Sie ein Element oder eine Beziehung selektieren können Sie die <code>Umschalt</code>-taste gedrückt halten, um dieses zu ihrer aktuellen Auswaähl hinzuzufügen. Mit <code>Strg+A</code> können Sie alle verfügbaren Element auswählen."
                },
                "duplicate": {
                    "title": "Elemente dulizieren",
                    "text": "Mit <code>Strg+D</code> können Sie aktuell selektierte Element mit all ihren Eigenschaften duplizieren."
                },
                "undo": {
                    "title": "Rückgängig machen & Wiederherstellen",
                    "text": "Mit <code>Strg+Z</code> und <code>Strg+Umschalt+Z</code> können Sie Ihre Änderungen rückgängig machen oder wiederherstellen."
                }
            }
        }
    }
}
