{
    "aboutUsOverview": {
        "title": "Artemis: Interactive Learning with Individual Feedback",
        "feature": "Main Features",
        "exercises": {
            "programming": {
                "text": "<a href='{{ programmingUrl }}'>Programming exercises</a> with version control, automatic individual feedback based on test cases and static code analysis."
            },
            "quiz": {
                "text": "<a href={{ quizUrl }}>Quiz exercises</a> with multiple choice, drag and drop, and short answer questions in individual, synchronized or batched mode with a practice mode."
            },
            "modeling": {
                "text": "<a href={{ modelingUrl }}>Modeling exercises</a> with an easy-to-use online modeling editor <a href={{ apollonUrl }}>Apollon</a> with semi-automatic assessment."
            },
            "text": {
                "text": "<a href={{ textUrl }}>Text exercises</a> with semi-automatic assessment using <a href={{ athenaUrl }}>Athena</a>."
            },
            "fileUpload": {
                "text": "<a href={{ fileUploadUrl }}>File upload exercises</a> with manual assessment."
            }
        },
        "exam": {
            "text": "<a href={{ examModeUrl }}>Exam mode:</a> <a href={{ instructorFeatureUrl }}>Instructors</a> create exams with variants, integrated plagiarism checks, test runs and student reviews. <a href={{ studentFeatureUrl }}>Students</a> participate with ease."
        },
        "grading": {
            "text": "<a href={{ gradingUrl }}>Grading:</a> Calculate and display grades using configurable grade keys for courses and exams. Export as csv files to university systems (e.g. CAMPUSonline)."
        },
        "assessment": {
            "text": "<a href={{ assessmentUrl }}>Assessment</a> Double-blind grading with structured criteria, integrated training, a leader board, ratings, and complaints improve consistency and fairness."
        },
        "communication": {
            "text": "<a href={{ communicationUrl }}>Communication:</a> Post announcements. Ask questions, post comments, and react to other posts. Filter unanswered questions."
        },
        "notifications": {
            "text": "<a href = {{ notificationsURL }}>Notifications:</a> Customizable for web and email. Users can enable and disable different notification types."
        },
        "teamExercises": {
            "text": "<a href={{ teamExercisesUrl }}>Team exercises</a> with real time collaboration and dedicated tutors per team."
        },
        "lectures": {
            "text": "<a href={{ lecturesUrl }}>Lectures:</a> Upload lecture slides for multiple units, integrate video streams, lecture recordings, and exercises into lectures, and define learning goals."
        },
        "integratedMarkdownEditor": {
            "text": "<b>Integrated markdown editor:</b> Instructors define problem statements using Markdown to easily format the text and integrate images and links."
        },
        "plagiarismChecks": {
            "text": "<a href={{ plagiarismChecksUrl }}>Plagiarism checks</a> for programming exercises (based on <a href={{ jPlagUrl }}>JPlag</a>), text exercises, and modeling exercises."
        },
        "learningAnalytics": {
            "text": "<a href={{ learningAnalyticsUrl }}>Learning analytics:</a> Statistics to compare based on the course average. Evaluate the average performance based on exercises and learning goals."
        },
        "scalable": {
            "text": "<a href={{ scalingUrl }}>Scalable</a> to multiple courses with thousands of students. Configure additional build agents in the continuous integration environment."
        },
        "highUserSatisfaction": {
            "text": "<a href={{ userExperienceUrl }}>High user satisfaction:</a> Artemis is easy to use and provides guided tutorials. Developers focus on usability, user experience, and performance."
        },
        "customizable": {
            "text": "<a href={{ customizableUrl }}>Customizable:</a> It supports multiple Instructors, Editors, and Tutors per course and allows Instructors to customize many course settings."
        },
        "openSource": {
            "text": "<a href={{ openSourceUrl }}>Open-source:</a> Free to use with a large community and many active maintainers."
        },
        "getInTouch": "Get in touch",
        "contributors": "Individual contributors",
        "projectManager": "Project Manager",
        "website": "Website"
    }
}
