{
    "aboutUsOverview": {
        "title": "Artemis: Interactive Learning with Individual Feedback",
        "feature": "Main Features",
        "exercises": {
            "programming": {
                "text": "<a href='{{ programmingUrl }}'>Programming exercises</a> with version control, automatic individual feedback (and assessment) based on test cases and static code analysis (executed using continuous integration)."
            },
            "quiz": {
                "text": "<a href={{ quizUrl }}>Quiz exercises</a> with multiple choice, drag and drop, and short answer questions."
            },
            "modeling": {
                "text": "<a href={{ modelingUrl }}>Modeling exercises</a> based on the easy-to-use online modeling editor <a href={{ apollonUrl }}>Apollon</a> with semi-automatic assessment using machine learning concepts."
            },
            "text": {
                "text": "<a href={{ textUrl }}>Text exercises</a> with manual, semi-automatic assessment based on supervised machine learning and natural language processing (NLP) using <a href={{ athenaUrl }}>Athena</a>."
            },
            "fileUpload": {
                "text": "<a href={{ fileUploadUrl }}>File upload exercises</a> with manual assessment"
            }
        },
        "exam": {
            "text": "<b>Exam mode:</b> Instructors can create online exams with exercise variants, integrated plagiarism checks, test runs and student reviews. You can find more information on <a href={{ studentFeatureUrl }}>Exam mode student features</a> and on <a href={{ instructorFeatureUrl }}>Exam mode instructor features</a>."
        },
        "grading": {
            "text": "<b>Grading:</b> Instructors can configure grade keys for courses and exams to automatically calculate grades and display them to students. Grades can be easily exported as csv files to upload them into university systems (such as CAMPUSonline)."
        },
        "assessment": {
            "text": "<b>Assessment:</b> Artemis uses double-blind grading and structured grading criteria to improve consistency and fairness. It integrates an assessment training process (based on example submissions and example assessments defined by the instructor), has a grading leader board, and allows students to rate the assessments. Students can complain or ask for more feedback."
        },
        "discussion": {
            "text": "<a href={{ discussionUrl }}>Discussion:</a> Instructors can post announcements. Students can ask questions, post comments, and react to other posts. Tutors can filter unanswered questions."
        },
        "notifications": {
            "text": "<b>Notifications:</b> Artemis supports customizable web and email notifications. Users can enable and disable different notification types."
        },
        "teamExercises": {
            "text": "<b>Team exercises:</b> Instructors can configure team exercises with real time collaboration and dedicated tutors per team."
        },
        "lectures": {
            "text": "<b>Lectures:</b> Instructors can upload lecture slides, divide lectures into units, integrate video streams, lecture recordings, and exercises into lectures, and define learning goals."
        },
        "integratedMarkdownEditor": {
            "text": "<b>Integrated markdown editor:</b> Instructors define problem statements using Markdown to easily format the text and integrate images and links."
        },
        "plagiarismChecks": {
            "text": "<b>Plagiarism checks:</b> Artemis integrates plagiarism checks for programming exercises (based on <a href={{ jPlagUrl }}>JPlag</a>), text exercises, and modeling exercises. It allows notifying students about identified plagiarism. Students can review and comment on the allegation."
        },
        "learningAnalytics": {
            "text": "<b>Learning analytics:</b> Artemis integrated different statistics for students to compare themselves to the course average. It allows instructors to evaluate the average student performance based on exercises and learning goals."
        },
        "scalable": {
            "text": "<b>Scalable:</b> Artemis scales to multiple courses with thousands of students. In fact, the largest course had 2,400 students. Administrators can easily scale Artemis with additional build agents in the continuous integration environment."
        },
        "highUserSatisfaction": {
            "text": "<b>High user satisfaction:</b> Artemis is easy to use, provides guided tutorials. Developers focus on usability, user experience, and performance."
        },
        "customizable": {
            "text": "<b>Customizable:</b> It supports multiple instructors, editors, and tutors per course and allows instructors to customize many course settings."
        },
        "openSource": {
            "text": "<b>Open-source:</b> Free to use with a large community and many active maintainers."
        },
        "getInTouch": "Get in touch",
        "contributors": "Individual contributors"
    }
}
