{
    "featureOverview": {
        "title": "Online Exams in Artemis",
        "featureDetails": "Feature Details",
        "instructor": {
            "pageTitle": "Exam Features for Instructors",
            "featureOverview": "Features Instructors",
            "feature": {
                "createConductAssess": {
                    "title": "Create, Conduct, and Assess Exams",
                    "shortDescription": "Create, conduct, and assess, all within the Artemis platform.",
                    "descriptionTextOne": "Artemis supports an exam mode, which offers a unique way of assessing the performance of your students. You can create exams for each course and register all or a selection of your students. Within the exam, you can set up programming, modeling, text, and quiz exercises, or import existing ones. Before releasing the exam to your students, you can conduct test runs to make sure everything is running smoothly. Define a working time for the exam and adjust for individual students as needed. Students may submit early if they wish.\n\nNo stable internet connection? Artemis saves all changes locally and automatically synchronizes every 30 seconds to avoid issues caused by unstable internet connections during the exam.\n\nOnce the exam is over, it is time to assess the submissions. Your assessment team may start grading exams from the Assessment Dashboard, which also visualizes overall progress.\n\nOnce all exams have been assessed you may release the results and give students the opportunity to review their result. If they believe to have found a mistake in their assessment, they may use the complaint feature to request a reassessment. A second assessor will then be able to re-assess the submission and decide whether to accept or reject the complaint.\n\nFinally, Artemis also creates a statistical report of the exam to evaluate and examine your students' performance.\n\nCreate, conduct, & assess, all within Artemis!"
                },
                "configuration": {
                    "title": "Fully Configurable",
                    "shortDescription": "Bulk register students from CSV files. Configure the exam to your needs. Edit working time of individual students",
                    "descriptionTextOne": "Artemis allows you to configure all aspects of an exam. You can set the name of the exam and the module number, examiner, and course name. Furthermore, you can pre-set the time frame according to your needs by deciding when the exam will become visible to the students, when the exam will automatically start, when the working time is over, and when the results will be published. Additionally, you can set the period in which the students can review their results and complain if necessary.\n\nYou can add exercises using the Artemis exercise types. Exam exercises can have multiple variants and can be marked as \"non-mandatory\", which ensures that every student receives a unique exam. Additionally, you can randomize the exercise order of every student's exam to further impede cheating.\n\nYou can register students in bulk by importing them from a CSV file, from all students registered in the exam course, or by selecting manually from all users registered on Artemis. Additionally, you can give time extensions to individual students."
                },
                "exerciseTypes": {
                    "title": "Multiple Exercise Types",
                    "shortDescription": "Programming, modeling, text, and quiz exercises.",
                    "descriptionTextOne": "Artemis supports programming, modeling, text, and quiz exercises with multiple-choice, drag and drop, and short answer questions in exam mode.\n\nFor programming exercises, students may choose to work with the online code editor or to clone the repository and work on the exercise in the integrated development environment (IDE) of their choice. Artemis uses the integrated and easy-to-use Apollon Editor for modeling exercises. It supports multiple diagram types, including UML class, activity, object, use case, communication, component, and deployment diagrams, as well as Petri nets and syntax trees. Your students can create models by intuitively dragging and dropping objects into the editor and connecting them using the appropriate arrows. Through the variety of its available exercise types, Artemis fulfills the requirements of most software engineering courses."
                },
                "exerciseVariants": {
                    "title": "Exercise Variants",
                    "shortDescription": "Make every student exam unique by adding variants to each exercise.",
                    "descriptionTextOne": "Artemis provides the possibility to create a unique exam for every student. You can create exercise groups that each contain multiple exercises. The number of exercise groups reflects the number of exercises on the exam. When generating an exam for every student, Artemis will randomly select one exercise from each exercise group and combine to create a unique exam for every student. You may also choose to randomize the exercise order. Additionally, you may distinguish between mandatory and non-mandatory exercises."
                },
                "testRunConduction": {
                    "title": "Conduct Test Runs",
                    "shortDescription": "Complete test runs of the exam to try out different variants.",
                    "descriptionTextOne": "Artemis allows you to create exam test runs. A test run simulates all steps of the exam process: the execution, assessment, and student review. You can select the exercises you would like to include in the test run and set the amount of working time. Then you can begin the working period and experience your exam as the students would. After submitting the exam, you can assess your submissions. The results will immediately be displayed in the test run summary, where you can also simulate complaints during a student review. Finally, you can evaluate the complaints to complete the exam process. \n\nTest runs are also a great way to familiarize your assessment team with the platform and the exam!"
                },
                "sessionMonitoring": {
                    "title": "Exam Session Monitoring",
                    "shortDescription": "Monitor the exam session to identify unusual activity.",
                    "descriptionTextOne": "Without a physical presence, it can feel as if you cannot observe your students closely enough. To counteract this, Artemis includes exam session monitoring. Artemis generates an exam session for every participant in the exam. The exam session contains, among other fields, when and where the student started the exam, the student's public IP address, and a unique fingerprint based on their browser and operating system. Additionally, the exam session generates a unique identifier that is sent with every request. Students have the option to switch between computers during the exam and also continue working while offline. As an instructor, you have the capability to analyze all students' sessions and behavior and flag those which appear suspicious."
                },
                "plagiarismDetection": {
                    "title": "Plagiarism detection",
                    "shortDescription": "Automatically detect and flag plagiarism attempts.",
                    "descriptionTextOne": "Artemis can support instructors in detecting plagiarism attempts. This is done by analyzing similarities among all student submissions and flagging those which exceed a given threshold. With the integrated plagiarism editor, you can compare all flagged submissions side by side and confirm those cases which show themselves as real plagiarism attempts. You can choose between different plagiarism detection strategies to apply the one that suits your needs. Additionally, instructors can download a CSV report of accepted and rejected plagiarism attempts for further processing on external systems."
                },
                "anonymousAssessment": {
                    "title": "Anonymous Assessment",
                    "shortDescription": "Anonymous assessment procedure to avoid prejudice.",
                    "descriptionTextOne": "The assessors can access students' exam submissions via the Assessment Dashboard. On this dashboard, they can request a new submission, provided that one is available for assessment. All submissions are anonymized to avoid bias or favoritism. To improve the accuracy and consistency of the assessors, you can define assessment instructions, sample submissions, and sample assessments to establish a common base of the grading expectations before the assessors begin."
                },
                "automaticAssessment": {
                    "title": "Automatic Assessment",
                    "shortDescription": "Automatic assessment of programming and quiz, semi-automatic assessment of text and modeling exercises.",
                    "descriptionTextOne": "Artemis supports correction with automatic and semi-automatic assessments for various exercise types. For quiz exercises, you may specify the correct solution in advance. After conducting an exam, you can prompt Artemis to automatically evaluate all submissions. For programming exercises, you can create a test suite, which for example applies structural and behavioral tests. These tests are then automatically executed for each student's submission at the end of the exam and evaluated accordingly. You can adjust the weight of each test, assign bonus points, and use static analysis tools to further support your assessment. All static analysis rules can be weighted independently, and you can define limits on how many points should be deducted if the same error occurs more than once. Finally, the automatic evaluation of programming tasks can be checked and confirmed or overwritten through manual evaluation. \n\nFor text and modeling exercises, you can activate automatic correction suggestions. Artemis uses machine learning to identify similar elements across submissions. Artemis analyzes instructor assessments to identify correct and incorrect elements and suggest assessments to the assessor. The goal is to reduce the required effort for the assessment and increase the quality and consistency of the evaluation."
                },
                "reviewIndividualExams": {
                    "title": "Review Individual Exams",
                    "shortDescription": "Review individual student exams with their submissions and scores.",
                    "descriptionTextOne": "While the assessment process is anonymous for tutors, as an instructor you can access and review individual student exams and their summaries. A student exam summary contains all the student's solutions to the exercises as well as their exercise-specific scores. You can also review their code by using the link to their exercise repository. This is also displayed on the student summary page together with the last commit hash. "
                },
                "assessmentMonitoring": {
                    "title": "Monitor Tutor and Assessment Progress",
                    "shortDescription": "Assessment dashboard for anonymous correction queuing. Includes a progress tracker for the assessment process.",
                    "descriptionTextOne": "Using the assessment dashboard, you always have an overview of how the assessment of the exam is coming along. This is indicated using an intuitive progress bar for every exercise in the exam which accurately displays how many submissions remain to be assessed. Lose no time and immediately publish the results once all exams have been assessed. You can also view the scores page to gain insights into the exam's outcome/results."
                },
                "complaints": {
                    "title": "Offer Student Review",
                    "shortDescription": "Allow students to review their exam. Review complaints and automatically apply changes.",
                    "descriptionTextOne": "After the results have been published, you can define a student review period. Each student can review their exam comfortably from their computer and take their time to understand the assessment. If they believe that they have found a mistake in an assessment, they can use the complaint feature to request a review. Additionally, students can provide their reasoning through a text note to clarify their objections. All complaints are collected and can be reviewed from the Assessment Dashboard. Each complaint is assessable by a third person (i.e. not the original assessor). They can review the assessment and decide to either accept or reject the student's complaint. The points given are then updated automatically, including the exam result."
                },
                "statistics": {
                    "title": "Generate Statistics",
                    "shortDescription": "Generate exam statistics to gain insights into the students' performance.",
                    "descriptionTextOne": "The exam is over, all exams have been assessed and the student complaints are evaluated. Now what?\n\nYou can evaluate the exam outcome using the statistics generated by Artemis. Review the students' performance using various metrics such as average, median, and standard deviation. Review the students' perceived difficulty of every exercise to improve exams in the future. Additionally, you can download all results to a CSV file to export them to external systems and create charts and graphs for further analysis."
                },
                "checklist": {
                    "title": "Follow Checklist",
                    "shortDescription": "Use the exam checklist to oversee and ensure every step of the exam is executed correctly.",
                    "descriptionTextOne": "Carrying out an exam is a long process with multiple points of failure. Artemis provides a checklist that gives you an overview of each step of an exam from creation of the exercises to exporting the results. The exam checklist contains the next action you need to take on a step and summarizes the progress taken so far to help you carry out all tasks correctly and completely. It also has navigation buttons so you can quickly take related actions or examine the progress in detail. Last but not least, it has a more compact overview version in the exam list page to glance over the preparation, conduction and correction status of the exams in the list."
                },
                "gradeKey": {
                    "title": "Create Grading Keys",
                    "shortDescription": "Create a grading key with custom or default grade steps for a course or an exam.",
                    "descriptionTextOne": "Scores are helpful to assess individual exercises but at the end of a semester you and your students would like to see a standard grade. On the grading key page, you can have a grading key for each course and exam, define the grade steps by specifying intervals, the minimum passing grade and the lower/upper bound inclusivity. The default grading key can also be generated with a single click. Artemis then automatically handles mapping scores to grade steps or bonus points, as well as calculating student result statistics based on grade steps."
                },
                "liveStatistics": {
                    "title": "Live Statistics",
                    "shortDescription": "Using Live Statistics, instructors can collect student interactions with the exam. This provides further opportunities for generating statistics.",
                    "descriptionTextOne": "Artemis offers the possibility for instructors to track the interaction of students with the exam during the exam. The interactions are collected, subsequently processed and visually presented to the instructors in different variants. Thus, Artemis offers the possibility that instructors, among other things, can view the current exercise of the students."
                }
            }
        },
        "students": {
            "pageTitle": "Exam Features for Students",
            "featureOverview": "Features Students",
            "feature": {
                "localIDE": {
                    "title": "Use Your IDE",
                    "shortDescription": "Clone the assignment and work on programming exercises on your IDE.",
                    "descriptionTextOne": "IDEs increase programmer productivity by combining common activities of writing software: editing source code, building executables, and debugging. Additionally, users can configure them at will to fit their own personal preferences. For online exams on Artemis, you have the ability to clone your programming assignment and work on it using your IDE. Use the clone button, get the assignment link and clone it using GIT commands. Once you are done, you can simply push your changes and continue to work on other tasks. Every push triggers a continuous integration system which automatically assesses your submission and provides feedback."
                },
                "codeEditor": {
                    "title": "Integrated Code Editor",
                    "shortDescription": "Complete the programming exercise using the integrated code editor.",
                    "descriptionTextOne": "In case you do not have access to a computer with an installed IDE, or you just want to make some quick changes on the fly, Artemis' exam mode provides an integrated code editor for you to finish the programming assignments. The Artemis code editor has an intuitive layout which includes a file browser and editor, a code area, the assignment description as well as a build log output to analyze your submissions. Errors are directly shown on the line which caused them, allowing you to quickly introduce a change to fix all issues. Your progress on the assignment is automatically updated with every submission you make."
                },
                "textEditor": {
                    "title": "Integrated Text Editor",
                    "shortDescription": "Solve text exercises using the integrated text editor.",
                    "descriptionTextOne": "To work on text exercises, Artemis provides an integrated text editor. The text editor is simple to use and easy to navigate. There is no limit to the length of the submission and it automatically tracks the number of words and characters in your submission."
                },
                "apollonEditor": {
                    "title": "Integrated Model Editor",
                    "shortDescription": "Create complex models easily through drag and drop using the simple and intuitive Apollon Editor.",
                    "descriptionTextOne": "Powered by the Apollon Editor, Artemis exam mode supports modeling exercises of different types. These include class, activity, object, use case, communication, component, and deployment diagrams, Petri nets, and syntax trees. Apollon makes it easy for you to create complex models with its intuitive drag and drop user interface. "
                },
                "quizExercises": {
                    "title": "Quiz Exercises",
                    "shortDescription": "Solve quiz exercises in the form of multiple choice, drag and drop and short answer questions.",
                    "descriptionTextOne": "The Artemis exam mode supports quizzes that can contain multiple-choice, drag and drop, and short answer questions. Artemis multiple-choice questions can have one or more solutions and the score can be adjusted so that, for example, no points are deducted if the answer is incorrect. This way it can mimic the exact grading style of your offline exams. For drag-and-drop questions, you can simply drag the appropriate element to the appropriate place. For short answer texts, you get input fields within a text, which you can fill in using your own words. "
                },
                "login": {
                    "title": "LRZ Login",
                    "shortDescription": "Log in through your LRZ account. No special account required.",
                    "descriptionTextOne": "Use the same LRZ credentials you use for all university applications to access Artemis. There is no need to create a new account and maintain another password! Log in using your TUMID and your password and you are ready to go."
                },
                "userInterface": {
                    "title": "Intuitive User Interface",
                    "shortDescription": "Navigate through the exam using the intuitive user interface.",
                    "descriptionTextOne": "You conduct the exam using Artemis' exam mode user interface. The interface hides all other Artemis functions to prevent distractions and lets you focus on the exam itself. At the top, a status bar indicates the status of each exercise and tracks your progress for each exercise using a color-coding approach. For instance, whenever you have unsaved changes, the status bar highlights the respective exercise in yellow. Once you save your progress or it is synchronized automatically it will be displayed accordingly. You can also use the status bar to navigate between exercises by simply clicking on the exercise.",
                    "descriptionTextTwo": "For every exercise type, the question/instructions will be displayed on the right. To the left, you will find the exercise-specific editor. To make sure that you do not miss a question in the quiz, an overview of all questions is displayed on the left. You can click on any question and the view will scroll accordingly. Once you have finished the exam you have the option to submit early. Otherwise, once the time runs out the view is automatically updated to the exam end confirmation page and your changes are automatically synchronized. After the end of the exam, you are given a grace period of a few minutes to confirm your exam end and conclude the exam."
                },
                "conduction": {
                    "title": "Online Exam",
                    "shortDescription": "Conduct exams on Artemis.",
                    "descriptionTextOne": "Artemis now supports the creation and conduction of online exams, all integrated into the platform! As a student, you have the ability to participate in online exams which can include, most Artemis exercise types such as programming, modeling, text, and quiz exercises such as multiple-choice questions. Navigate through them easily using the intuitive and responsive user interface. Your progress is saved locally and synchronized every 30 seconds, so even if you lose your internet connection you can continue to work offline. After you have handed in the exam, you have access to the summary which provides an overview of your solutions. The assessors will anonymously grade your exam supported by Artemis' automatic and semi-automatic assessment. You will be able to review the results comfortably from your home with no geographic restrictions. You can conduct and review your exam from anywhere around the world."
                },
                "offline": {
                    "title": "Continue Working Offline",
                    "shortDescription": "Continue working offline if you are disconnected.",
                    "descriptionTextOne": "The exam mode in Artemis is tolerant towards internet connection issues. In case you are not connected, you can continue working on text, quiz and modeling exercises. If your internet connection recovers, Artemis will automatically save your solution. This is possible, as the platform tries to save your solution every 30 seconds, when you navigate between exercises as well as when you click hit save. For programming exercises, if you work using your own local IDE, you only need to be online when you clone the repository and when you push your commits (i.e. submit your solution)."
                },
                "summary": {
                    "title": "Exam Summary",
                    "shortDescription": "You always have access to the summary of your exam.",
                    "descriptionTextOne": "\"What was your answer to question 2?\"\n\n-\"I can't remember anymore, I think option B.\"\n\nArtemis allows you to access your personal exam and review your submission through the summary page, which becomes available after handing it in. The summary includes an overview of all your exercise submissions and displays them in an aggregated view. Additionally, for programming exercises, it includes the last commit hash as well as the link to your repository where you will be able to view and analyze the code. In case you want to store it locally on the device of your choice, Artemis offers the option to download the complete summary as a PDF file."
                },
                "qualityAndFair": {
                    "title": "Quality and Fairness of the Assessment",
                    "shortDescription": "Artemis enables an anonymous assessment of the exams supported by automatic assessments.",
                    "descriptionTextOne": "Artemis enables an anonymized evaluation process in order to facilitate a fair evaluation, free from bias or favoritism and deviations between different assessors. Every assessor is required to work through the example submissions and solutions before they can start assessing the students' exams. Additionally, the platform supports the assessment process with automatic and semi-automatic assessments for all supported exercise types. Quiz- and programming exercises are assessed automatically. This automatic assessment can be enhanced with manual assessment to further increase the accuracy of the evaluation. Artemis learns through machine learning which elements are correct and which are incorrect to further support the assessors. This feature can be enabled for text- and modeling exercises. When it is activated, it suggests how elements of the submissions should be evaluated during the course of further correction. The goal is to reduce the required effort and to increase the quality and fairness of the evaluation."
                },
                "onlineReview": {
                    "title": "Online Exam Review",
                    "shortDescription": "Review the assessment of your exam from anywhere in the world.",
                    "descriptionTextOne": "After the results have been published, you can access your exam and review the assessment comfortably from your computer. Take your time to really analyze the question and the assessment to understand what mistakes you made. There are no location restrictions to the exam review, you can access it from anywhere! \n\nSometimes mistakes can happen during the exam assessment. Using the complaint functionality, you can complain about an assessment and provide some information on why you feel you were not assessed correctly. All student complaints will be collected and a different assessor will have the chance to either accept or reject your complaint. If your complaint is accepted, your points will be automatically updated!"
                },
                "browserCompatibility": {
                    "title": "Compatible with all Major Browsers.",
                    "shortDescription": "Use Artemis on all major browsers.",
                    "descriptionTextOne": "Artemis exam mode is compatible with all major browsers including Chrome, Safari, Edge and Opera. We provide active support for Google Chrome and Chromium browsers."
                },
                "gradeKey": {
                    "title": "View Grading Keys",
                    "shortDescription": "See your final and attained grade for a course or an exam as soon as you have a new assignment graded.",
                    "descriptionTextOne": "When a grading key for a course or an exam is defined, you can examine it and see the score interval corresponding to each grading step and the minimum grade needed to pass. Grading keys also have a bonus points mode which converts the obtained score to a bonus. You don't have to wait until the end of the semester to use the grading key, you can always check out your attained grade based on the exercises conducted and assessed so far."
                }
            }
        }
    }
}
