{
    "tour": {
        "courseExerciseOverview": {
            "installPrerequisites": {
                "headline": "Install required tools",
                "content": "Before we have a look at this course and the example exercise, we need to download and install a few software tools. Install the newest version of <a href='https://www.jetbrains.com/idea/download/' target='_blank' rel='noopener noreferrer'>IntelliJ</a> as shown in the video.",
                "videoUrl": "https://live.rbg.tum.de/w/artemisintro/25976?video_only=1"
            },
            "exercises": {
                "headline": "Exercises",
                "content": "This tab lists all exercises for the selected course."
            },
            "exerciseRow": {
                "headline": "Current week",
                "content": "The exercises of the current week will be displayed at the top of the exercise list."
            },
            "currentExercise": {
                "headline": "Current Exercise",
                "content": "In this tutorial we will have a look at the <tt>Hello World</tt> exercise."
            },
            "exerciseType": {
                "headline": "Exercise type",
                "content": "The exercise type can be distinguished by the exercise icon. Here it is a programming exercise."
            },
            "exerciseTags": {
                "headline": "Exercise tags",
                "content": "The listed tags will further classify the exercises, e.g. by difficulty."
            },
            "courseInformation": {
                "headline": "Course information",
                "content": "This box displays general course information, such as the number of exercises and the time frame of the course."
            },
            "upcomingDueDates": {
                "headline": "Upcoming due dates",
                "content": "Here you can see which exercises are due in the next few days."
            },
            "lectures": {
                "headline": "Lectures",
                "content": "You can find and download all lecture slides from this tab."
            },
            "statistics": {
                "headline": "Statistics",
                "content": "This tab shows statistics about your grades and exercise performance so far."
            },
            "startExercise": {
                "headline": "Start with your first programming exercise",
                "content": "Click on the <tt>Start exercise</tt> button to start working on the exercise. This action takes a few seconds, since a personal repository is being set up for you in the background"
            },
            "startExerciseWait": {
                "headline": "Start with your first programming exercise",
                "content": "Please stand by while Artemis sets up your personal repository..."
            },
            "repositoryCreated": {
                "headline": "Your repository has been created",
                "content": "Your repository is ready to be cloned. Proceed with the next step to about cloning and solving programming exercises on Artemis."
            },
            "cloneRepository": {
                "headline": "Clone repository in IntelliJ",
                "content": "Watch the following video to learn how to clone a git repository in IntelliJ. After this step, you should click on the <tt>X</tt> button in the top right to stop the tutorial and apply the steps you saw in the video. Afterwards, resume the tutorial from your account menu (username on the top right).",
                "hint": "If you haven't installed the Java JDK 17 version, the video will show you how to do this.",
                "videoUrl": "https://live.rbg.tum.de/w/artemisintro/25977?video_only=1"
            },
            "solveExercise": {
                "headline": "Solve the exercise",
                "content": "In this video we will inspect the project, solve the given task and push the repository to Artemis.",
                "videoUrl": "https://live.rbg.tum.de/w/artemisintro/25978?video_only=1"
            },
            "reviewResult": {
                "headline": "Review your result",
                "content": "After you have committed and pushed your changes as described in the previous video, the result will be automatically refreshed and displayed here. Artemis uses test cases to automatically assess your solution. If you now click on the exercise panel, you will come to the exercise detail page to review the test case results."
            }
        }
    }
}
