{
    "tour": {
        "programmingExercise": {
            "codeEditor": {
                "fileBrowser": {
                    "headline": "File Browser",
                    "content": "In the file browser you can view the project structure with all its folders and files. You can also create your own folders and files, if necessary."
                },
                "exerciseFile": {
                    "headline": "Class file",
                    "content": "Click on the class file to display its source code in the editor."
                },
                "monacoEditor": {
                    "headline": "Code editor",
                    "content": "The source code is now displayed in the code editor. You can read through the <tt>TODO</tt> and try to solve it. Alternatively, you can enter any code for this test round. If you are done with your implementation, just click on the <tt>Next</tt> button to proceed."
                },
                "saveChanges": {
                    "headline": "Save changes",
                    "content": "You can save your changes in the code editor by clicking on <tt>Save</tt>."
                },
                "submitChanges": {
                    "headline": "Submit changes",
                    "content": "If you are satisfied with your implementation, then you can submit your current code by clicking <tt>Submit</tt>.",
                    "hint": "Here is a quick note: You can submit as many times as you want before the due date passes, so feel free to solve and submit each task one by one."
                }
            },
            "buildLoading": {
                "headline": "Build and tests",
                "content": "After submitting your changes, Artemis will automatically build and test your code."
            },
            "buildStatus": {
                "headline": "Build status",
                "content": "You can now see your build status here and identify which tasks have been successfully solved and which have not.",
                "hint": "Some additional tests may be run after the due date. This means that passing all displayed tests does not necessarily guarantee a final score of 100%. Therefore, please check your implementation carefully."
            },
            "testCases": {
                "headline": "Feedback",
                "content": "In this window you can view feedback on your submission. Please try to solve all errors to pass this programming exercise successfully."
            },
            "testSuccess": {
                "headline": "Task solved",
                "content": "Here you can see that you have successfully solved this task and all tests have been executed successfully."
            },
            "testFailure": {
                "headline": "Task unsolved",
                "content": "Here you can see the failing test cases for every task that has not yet been successfully solved."
            },
            "umlSuccess": {
                "headline": "Review your implementation in the UML diagram",
                "content": "You can now see whether you have successfully implemented the UML class diagram."
            },
            "umlFailure": {
                "headline": "Review your failed tests in the UML diagram",
                "content": "You can now see which tests have passed, and which have failed."
            },
            "resolveTasks": {
                "headline": "Complete exercise",
                "content": "Please open Eclipse again and resolve the remaining tasks to complete the exercise."
            },
            "reviewResult": {
                "headline": "Review your result",
                "content": "Please check if all tests have been executed successfully."
            },
            "exerciseSuccess": {
                "headline": "Congratulations!",
                "content": "You have successfully solved your first programming exercise on Artemis with git!"
            }
        }
    }
}
