{
    "tour": {
        "courseExerciseOverview": {
            "installPrerequisites": {
                "headline": "Install required tools",
                "content": "Before we have a look at this course and the example exercise, we need to download and install a few software tools.<ul><li>Please download and install the newest <a href='https://www.oracle.com/java/technologies/javase-downloads.html' target='_blank' rel='noopener noreferrer'>Java JDK</a> (at least Java JDK 17). Make sure to choose JDK and <span class='red bold'>not</span> JRE.</li><li>Please download and install <a href='https://www.eclipse.org/downloads/packages/' target='_blank' rel='noopener noreferrer'>Eclipse IDE for Java Developers</a> (2022‑06 or later)</li><li>Please download and install <a href='https://www.sourcetreeapp.com' target='_blank' rel='noopener noreferrer'>SourceTree</a> with git (4.1.5 or later for macOS and 3.4.6 or later for Windows).</li></ul>",
                "hint": "Make sure to also install the git command line tools while installing SourceTree. In case you are using Linux, you can e.g. use <a href='https://www.gitkraken.com/download' target='_blank' rel='noopener noreferrer'>Git Kraken</a> or the <a href='https://git-scm.com' target='_blank' rel='noopener noreferrer'>command line</a>.",
                "sourceTreeSetup": {
                    "headline": "Set up SourceTree",
                    "content": "Watch the following video and follow the steps to set up SourceTree. Afterwards we will be done with the setup and can have a look at the course page and its content.",
                    "videoUrl": "https://www.youtube.com/embed/UMGDMqE0RyE?rel=0"
                }
            },
            "exercises": {
                "headline": "Exercises",
                "content": "This tab lists all exercises for the selected course."
            },
            "exerciseRow": {
                "headline": "Current week",
                "content": "The exercises of the current week will be displayed at the top of the exercise list."
            },
            "currentExercise": {
                "headline": "Current Exercise",
                "content": "In this tutorial we will have a look at the <tt>Hello World</tt> exercise."
            },
            "exerciseType": {
                "headline": "Exercise type",
                "content": "The exercise type can be distinguished by the exercise icon. Here it is a programming exercise."
            },
            "exerciseTags": {
                "headline": "Exercise tags",
                "content": "The listed tags will further classify the exercises, e.g. by difficulty."
            },
            "courseInformation": {
                "headline": "Course information",
                "content": "This box displays general course information, such as the number of exercises and the time frame of the course."
            },
            "upcomingDeadlines": {
                "headline": "Upcoming deadlines",
                "content": "Here you can see which exercises are due in the next few days."
            },
            "lectures": {
                "headline": "Lectures",
                "content": "You can find and download all lecture slides from this tab."
            },
            "statistics": {
                "headline": "Statistics",
                "content": "This tab shows statistics about your grades and exercise performance so far."
            },
            "startExercise": {
                "headline": "Start with your first programming exercise",
                "content": "Click on the <tt>Start exercise</tt> button to start working on the exercise. This action takes a few seconds, since a personal repository is being set up for you in the background"
            },
            "startExerciseWait": {
                "headline": "Start with your first programming exercise",
                "content": "Please stand by while Artemis sets up your personal repository..."
            },
            "repositoryCreated": {
                "headline": "Your repository has been created",
                "content": "Your repository is ready to be cloned. Proceed with the next step to learn more."
            },
            "cloneRepository": {
                "headline": "Clone repository in SourceTree",
                "content": "Watch the following video to learn how to clone a git repository in SourceTree. After this step, you should click on the <tt>X</tt> button in the top right to stop the tutorial and apply the steps you saw in the video. Afterwards, resume the tutorial from your account menu",
                "videoUrl": "https://www.youtube.com/embed/MtwpehC7fcA?rel=0"
            },
            "inspectSourceTree": {
                "headline": "Inspect SourceTree",
                "content": "Watch the following video to get acquainted with the basic functions in SourceTree.",
                "videoUrl": "https://www.youtube.com/embed/zky4NnIVzLw?rel=0"
            },
            "importEclipse": {
                "headline": "Import the Java project in Eclipse",
                "content": "Watch the following video to learn how to import the project in Eclipse.",
                "videoUrl": "https://www.youtube.com/embed/VOEJ84cWgK4?rel=0"
            },
            "inspectProject": {
                "headline": "Inspect Project",
                "content": "In this video we will inspect the project and solve the given task.",
                "videoUrl": "https://www.youtube.com/embed/DwSqaraLWIc?rel=0"
            },
            "commitAndPush": {
                "headline": "Submit your changes",
                "content": "Watch the following video to learn how to commit and push your changes.",
                "videoUrl": "https://www.youtube.com/embed/3bmaLuT7RNI?rel=0"
            },
            "reviewResult": {
                "headline": "Review your result",
                "content": "After you have committed and pushed your changes as described in the previous video, the result will be automatically refreshed and displayed here. Artemis uses test cases to automatically assess your solution. If you now click on the exercise panel, you will come to the exercise detail page to review the test case results."
            }
        }
    }
}
