{
    "tour": {
        "tutorCourseDashboard": {
            "overview": {
                "headline": "Overview",
                "content": "Here you can see an overview of your assessments, complaints and feedback requests."
            },
            "exerciseTable": {
                "headline": "Exercise Table",
                "content": "This table displays all exercises of this course, which are not finished yet. In order to see finished exercises, just tick the checkbox <tt>Show finished exercises</tt> displayed right above this table."
            },
            "gradingProcess": {
                "headline": "Grading Process",
                "content": "This graph visualizes your current grading process. You can hover over these nodes to find out more about the grading process steps after this tutorial."
            },
            "exerciseDashboardButton": {
                "headline": "Exercise Dashboard",
                "content": "Now let's head over to the exercise dashboard to view the exercise details and student submissions."
            }
        },
        "tutorExerciseDashboard": {
            "instructions": {
                "headline": "Instructions",
                "content": "This section contains the <tt>problem statement</tt>, <tt>example solution</tt> and <tt>grading instruction</tt> of the exercise. Please read through them carefully and then proceed to the next step."
            },
            "instructionsButton": {
                "headline": "Confirm",
                "content": "Click on this button and confirm only after you have read and understood the instructions."
            },
            "studentSubmissions": {
                "headline": "Student submissions",
                "content": "In this table you can see the current student submissions."
            },
            "startAssessment": {
                "headline": "Start Assessment",
                "content": "If you want to assess this submission, then just click on <tt>start new assessment</tt>.",
                "hint": "If you start an assessment, then this submission will be locked by you, so that other tutors cannot access it, while you are working on the assessment. In this tutorial we have therefore disabled the assessment button."
            }
        },
        "assessment": {
            "modelingExercise": {
                "headline": "Assessing modeling exercise submissions",
                "content": "You can assess the different parts of the model by clicking on them as shown in the animation below. Once you have reviewed every part of the model, you can submit your assessment."
            },
            "textExercise": {
                "headline": "Assessing text exercise submissions",
                "content": "You can highlight the text block you want to assess and click the <tt>assess</tt> button to add the score and feedback as shown in the animation below. Once you are done with the review, you can submit your assessment ."
            }
        }
    }
}
