{
    "artemisApp": {
        "modelingAssessmentEditor": {
            "conflicts": "Conflict",
            "ownAssessmentTitle": "Your current assessment",
            "conflictingAssessmentTitle": "1st out of {{count}} conflicting assessments. Assessed by",
            "button": {
                "applyChanges": "Apply Changes",
                "keepYours": "Keep Yours",
                "acceptTheirs": "Take Over"
            },
            "messages": {
                "lock": "You now have the lock on this submission. Only you can assess this model. Please assess this model before opening other submissions.",
                "noModel": "This submission does not contain a model.",
                "loadSubmissionFailed": "Retrieving requested submission failed.",
                "saveSuccessful": "Your assessment was saved successfully!",
                "saveFailed": "Saving your assessment failed!",
                "submitSuccessful": "Your assessment was submitted successfully!",
                "submitFailed": "Submitting your assessment failed!",
                "submitFailedWithConflict": "Submission failed! Conflict with existing Assessments detected",
                "resultDismissed": "Your assessment was dismissed because another tutor already graded this model.",
                "updateAfterComplaintSuccessful": "The assessment was updated successfully.",
                "updateAfterComplaintFailed": "Updating the assessment failed.",
                "confirmSubmission": "You have not assessed all model elements. Are you sure you want to submit this assessment? You will not be able to change it afterwards.",
                "confirmCancel": "Are you sure you want to cancel the assessment? Your current assessment progress will be deleted, and the submission will be available for assessment to other tutors again.",
                "noConflicts": "Conflicts could not be loaded",
                "conflictsResolved": "All conflicts have been processed.",
                "feedbackTextTooLong": "Failed to save assessment. Feedback text must be no longer than 500 characters.",
                "loadFeedbackSuggestionsFailed": "Retrieving automatically generated feedback suggestions failed."
            },
            "automaticAssessmentAvailable": "Congratulations! To save you some time, parts of this model were already assessed automatically. Please review the automatic assessment and assess the rest of the model afterwards. By submitting the assessment you also confirm the automatic assessment. Please be aware that you are responsible for the whole assessment.",
            "automaticAssessmentLoading": "Loading automatically generated feedback suggestions...",
            "generativeAIAssessmentAvailable": "Artemis created initial feedback based on generative AI but can make mistakes doing so. Consider checking important information.",
            "generativeAIAssessmentInfo": "Artemis is using generative AI to create feedback suggestions for submissions based on the problem statement and assessment instructions provided. While these suggestions hopefully help you grade submissions more efficiently, it is important to be aware that AI does not always produce entirely accurate results. It is therefore important that you review the suggestions made and adapt them when required. You are responsible for the whole assessment including the suggestions you reviewed.",
            "highlightingColors": {
                "title": "Highlighting Color(s)",
                "automaticAssessment": "automatic assessment",
                "missingAssessment": "missing assessment"
            }
        }
    }
}
