{
    "artemisApp": {
        "tutorialGroupImportDialog": {
            "warning": "Warning",
            "finishedWarning": "Artemis has finished importing the tutorial group. Be aware that the tutorial groups were created without schedule and default settings such as assigning yourself as tutor. You can change these settings and add a schedule by editing the respective groups.",
            "importButton": "Import Tutorial Groups",
            "dialogTitle": "Import Tutorial Group Registrations",
            "explanations": {
                "description": "This dialog allows you to import tutorial groups and student registrations from a CSV file. If a tutorial group does not exist, it will be created. If students are listed in the CSV then they will be moved from their current tutorial group to the new one specified in the CSV file. If a tutorial group exists but does not add any students to it, then it will not be imported.",
                "requirements": "The top row of the CSV file must specify the headers. Each row must include a title for the tutorial group. To register students, each row must additionally include either the matriculation number or the login of the student. First and last names are optional."
            },
            "supportedHeaderNames": {
                "label": "Supported header names (versions with spaces, underscores, hyphens and uppercase letters are also supported): ",
                "format": "The bullet points below show the header names that the system can recognize (left side) and how they will be interpreted after parsing the CSV file (right side).",
                "alwaysRequired": "One of these Header is always required to identify the tutorial group: ",
                "requiredIfStudentRegistration": "One of these is required as Header if you want to identify and register students:",
                "alwaysOptional": "Optional Headers (just for display purposes): ",
                "tutorialGroupTitle": "Tutorial Group, gruppe, titel, group, title, tutorial group -> Tutorial Group",
                "registrationNumber": "Matriculation Number, Matrikelnummer, registrationnumber, matriculationnumber, matrikelnummer, number -> Matriculation Number",
                "login": "Login, Anmeldename, login, user, username, benutzer, benutzername -> Login",
                "firstName": "First Name, Vorname, firstname, firstnameofstudent, givenname, forename, vorname -> First Name",
                "lastName": "Last Name, Nachname, familyname, lastname, familynameofstudent, surname, nachname, familienname, name -> Last Name",
                "campus": "Campus, campus -> Campus",
                "language": "Language, Sprache, language -> Language",
                "additionalInformation": "Additional Information, additionalinformation -> Additional Information",
                "capacity": "Capacity, capacity -> Capacity",
                "isOnline": "is Online, ist Online, isonline -> Is Online"
            },
            "errorMessages": {
                "genericErrorMessage": "Import of tutorial groups failed!",
                "withoutTitle": "The following rows miss a tutorial group title: ",
                "invalidTitle": "The following rows have an invalid tutorial group title (Titles may only contain letters, numbers, spaces and hyphens and max 19 characters): ",
                "noIdentificationInformation": "The following rows specify a user but do not contain a login or matriculation number: ",
                "duplicatedLogins": "The following logins are assigned to multiple tutorial groups: ",
                "duplicatedRegistrationNumbers": "The following matriculation numbers are assigned to multiple tutorial groups: "
            },
            "serverErrors": {
                "notitle": "No tutorial group title",
                "nologinorregistrationnumber": "No login or matriculation number",
                "nouserfound": "No matching student found in course",
                "multipleregistrations": "Multiple registrations in CSV for student"
            },
            "csvFile": {
                "label": "Select a CSV file",
                "validationFailed": "Please repair the file, it is not considered valid due to the following error: ",
                "parseCSVButton": "Parse CSV"
            },
            "fixedPlaceForm": {
                "checkbox": {
                    "label": "Do you want to only parse certain rows? Then specify a header and the required value for that header to filter the rows accordingly.",
                    "explanation": "Only rows with the specified value in the specified header column will be parsed from the CSV file. For Example: Only students who have a 'confirmed place' as value in the 'Place' Header should be parsed from the CSV file."
                },
                "statusHeaderInput": {
                    "label": "Status Header",
                    "placeholder": "Enter the header that contains the status of the registration. E.g. 'Place'",
                    "maxLengthValidationError": "Status Header is limited to {{ max }} characters!"
                },
                "fixedPlaceValueInput": {
                    "label": "Confirmed Value",
                    "placeholder": "Enter the value that indicates a confirmed fixed place. E.g. 'Confirmed Place'",
                    "maxLengthValidationError": "Confirmed Value is limited to {{ max }} characters!"
                }
            },
            "table": {
                "example1": "This example CSV format shows the minimum required headers to parse a CSV:",
                "example2": "This example CSV format shows the headers required to register students with a registration number, with First Name and Last Name being optional:",
                "example3": "This example CSV format shows the headers required to register students with a login, with First Name and Last Name being optional:",
                "example4": "This example CSV format shows the optional headers in addition to the headers which allow student import that can be added (it is not necessary to have all optional headers in order to import one optional header):",
                "template": "Download Example",
                "showNotImportedButton": "Not imported registrations",
                "showImportedButton": "Imported registrations",
                "showAllButton": "All registrations",
                "groupA": "Group A",
                "groupB": "Group B",
                "columns": {
                    "title": "Tutorial Group",
                    "registrationNumber": "Matriculation Number",
                    "login": "Login",
                    "firstName": "First Name",
                    "lastName": "Last Name",
                    "campus": "Campus",
                    "language": "Language",
                    "additionalInformation": "Additional Information",
                    "capacity": "Capacity",
                    "isOnline": "is Online",
                    "error": "Error"
                },
                "footer": {
                    "imported": "Imported: {{ count }} Registrations",
                    "notImported": "Not imported: {{ count }} Registrations",
                    "total": "Total: {{ count }} Registrations"
                }
            }
        }
    }
}
