{
    "artemisApp": {
        "tutorialGroupImportDialog": {
            "warning": "Warning",
            "finishedWarning": "Artemis has finished importing the tutorial group. Be aware that the tutorial groups were created without schedule and default settings such as assigning yourself as tutor. You can change these settings and add a schedule by editing the respective groups.",
            "importButton": "Import Tutorial Groups",
            "dialogTitle": "Import Tutorial Group Registrations",
            "explanations": {
                "description": "This dialog allows you to import tutorial groups and student registrations from a CSV file. If a tutorial group does not exist, it will be created. If students are listed in the CSV then they will be moved from their current tutorial group to the new one specified in the CSV file.",
                "requirements": "The top row of the CSV file must specify the headers. Each row must include a title for the tutorial group. To register students, each row must additionally include either the matriculation number or the login of the student. First and last names are optional."
            },
            "supportedHeaderNames": {
                "label": "Supported header names (versions with spaces, underscores, hyphens and uppercase letters are also supported): ",
                "alwaysRequired": "One of these Header is always required (to identify tutorial group): ",
                "requiredIfStudentRegistration": "One of these is required as Header if you want to identify and register students :",
                "alwaysOptional": "Optional Headers (just for display purposes): ",
                "tutorialGroupTitle": "gruppe, titel, group, title -> After parsing the CSV this will be saved as a Header named Tutorial Group",
                "registrationNumber": "registrationnumber, matriculationnumber, matrikelnummer, number -> After parsing the CSV this will be saved as a header named Matriculation Number",
                "login": "login, user, username, benutzer, benutzername -> After parsing the CSV this will be saved as a header named Login",
                "firstName": "firstname, firstnameofstudent, givenname, forename, vorname -> After parsing the CSV this will be saved as a header named First Name",
                "lastName": "familyname, lastname, familynameofstudent, surname, nachname, familienname, name -> After parsing the CSV this will be saved as a header named Last Name"
            },
            "errorMessages": {
                "genericErrorMessage": "Import of tutorial groups failed!",
                "withoutTitle": "The following rows miss a tutorial group title: ",
                "invalidTitle": "The following rows have an invalid tutorial group title (Titles may only contain letters, numbers, spaces and hyphens and max 19 characters): ",
                "noIdentificationInformation": "The following rows specify a user but do not contain a login or matriculation number: ",
                "duplicatedLogins": "The following logins are assigned to multiple tutorial groups: ",
                "duplicatedRegistrationNumbers": "The following matriculation numbers are assigned to multiple tutorial groups: "
            },
            "serverErrors": {
                "notitle": "No tutorial group title",
                "nologinorregistrationnumber": "No login or matriculation number",
                "nouserfound": "No matching student found in course",
                "multipleregistrations": "Multiple registrations in csv for student"
            },
            "csvFile": {
                "label": "Select a .csv file",
                "validationFailed": "Please repair the file, it is not considered valid due to the following error: ",
                "parseCSVButton": "Parse CSV"
            },
            "fixedPlaceForm": {
                "checkbox": {
                    "label": "Do you want to only parse certain rows? Then specify a header and the required value for that header.",
                    "explanation": "Only rows with the specified value in the specified header column will be parsed from the CSV file. For Example: Only students who have a 'confirmed place' as value in the 'Place' Header should be parsed from the CSV file."
                },
                "statusHeaderInput": {
                    "label": "Status Header",
                    "placeholder": "Enter the header that contains the status of the registration. E.g. 'Place'",
                    "maxLengthValidationError": "Status Header is limited to {{ max }} characters!"
                },
                "fixedPlaceValueInput": {
                    "label": "Confirmed Value",
                    "placeholder": "Enter the value that indicates a confirmed fixed place. E.g. 'Confirmed Place'",
                    "maxLengthValidationError": "Confirmed Value is limited to {{ max }} characters!"
                }
            },
            "table": {
                "example1": "Example CSV Format (minimum):",
                "example2": "Example CSV Format to register students with registration number:",
                "example3": "Example CSV Format to register students with login:",
                "showNotImportedButton": "Not imported registrations",
                "showImportedButton": "Imported registrations",
                "showAllButton": "All registrations",
                "groupA": "Group A",
                "groupB": "Group B",
                "columns": {
                    "title": "Tutorial Group",
                    "registrationNumber": "Matriculation Number",
                    "login": "Login",
                    "firstName": "First Name",
                    "lastName": "Last Name",
                    "error": "Error"
                },
                "footer": {
                    "imported": "Imported: {{ count }} Registrations",
                    "notImported": "Not imported: {{ count }} Registrations",
                    "total": "Total: {{ count }} Registrations"
                }
            }
        }
    }
}
